{
  "categories": {
    "164.306": {
      "type": "SECTION",
      "name": "Security standards: General rules.",
      "controls": {
        "164.306(c)": "Standards. A covered entity or business associate must comply with the applicable standards as provided in this section and in 164.308, 164.310, 164.312, 164.314 and 164.316 with respect to all electronic protected health information.",
        "164.306(e)": "Maintenance. A covered entity or business associate must review and modify the security measures implemented under this subpart as needed to continue provision of reasonable and appropriate protection of electronic protected health information, and update documentation of such security measures in accordance with  164.316(b)(2)(iii)."
      },
      "categories": {
        "164.306(a)": {
          "name": "General requirements. Covered entities and business associates must do the following:",
          "type": "SUBSECTION",
          "controls": {
            "164.306(a)(1)": "Ensure the confidentiality, integrity, and availability of all electronic protected health information the covered entity or business associate creates, receives, maintains, or transmits.",
            "164.306(a)(2)": "Protect against any reasonably anticipated threats or hazards to the security or integrity of such information.",
            "164.306(a)(3)": "Protect against any reasonably anticipated uses or disclosures of such information that are not permitted or required under subpart E of this part.",
            "164.306(a)(4)": "Ensure compliance with this subpart by its workforce."
          }
        },
        "164.306(b)": {
          "name": "Flexibility of approach.",
          "type": "SUBSECTION",
          "controls": {
            "164.306(b)(2)(i)": "The size, complexity, and capabilities of the covered entity or business associate.",
            "164.306(b)(2)(ii)": "The covered entity's or the business associate's technical infrastructure, hardware, and software security capabilities.",
            "164.306(b)(2)(iii)": "The costs of security measures.",
            "164.306(b)(2)(iv)": "The probability and criticality of potential risks to electronic protected health information."
          },
          "categories": {
            "164.306(b)(2)": {
              "name": "In deciding which security measures to use, a covered entity or business associate must take into account the following factors:",
              "type": "PARAGRAPH"
            }
          }
        },
        "164.306(d)": {
          "name": "Implementation specifications. In this subpart:",
          "type": "SUBSECTION",
          "controls": {
            "164.306(d)(1)": "(1) Implementation specifications are required or addressable. If an implementation specification is required, the word 'Required' appears in parentheses after the title of the implementation specification. If an implementation specification is addressable, the word 'Addressable' appears in parentheses after the title of the implementation specification.",
            "164.306(d)(2)": "(2) When a standard adopted in 164.308, 164.310, 164.312, 164.314, or 164.316 includes required implementation specifications, a covered entity or business associate must implement the implementation specifications."
          },
          "categories": {
            "164.306(d)(3)": {
              "name": "(3) When a standard adopted in 164.308, 164.310, 164.312, 164.314, or 164.316 includes addressable implementation specifications, a covered entity or business associate must",
              "type": "PARAGRAPH",
              "controls": {
                "164.306(d)(3)(i)": "(i) Assess whether each implementation specification is a reasonable and appropriate safeguard in its environment, when analyzed with reference to the likely contribution to protecting electronic protected health information; and"
              },
              "categories": {
                "164.306(d)(3)(ii)": {
                  "name": "(ii) As applicable to the covered entity or business associate",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.306(d)(3)(ii)(A)": "(A) Implement the implementation specification if reasonable and appropriate; or"
                  },
                  "categories": {
                    "164.306(d)(3)(ii)(B)": {
                      "name": "(B) If implementing the implementation specification is not reasonable and appropriate",
                      "type": "ITEM",
                      "controls": {
                        "164.306(d)(3)(ii)(B)(1)": "Document why it would not be reasonable and appropriate to implement the implementation specification; and",
                        "164.306(d)(3)(ii)(B)(2)": "Implement an equivalent alternative measure if reasonable and appropriate."
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "164.308": {
      "type": "SECTION",
      "name": "Administrative safeguards.",
      "categories": {
        "164.308(a)": {
          "name": "A covered entity or business associate must, in accordance with 164.306:",
          "type": "SUBSECTION",
          "categories": {
            "164.308(a)(1)": {
              "name": "<Included as heading for controls underneath>",
              "type": "PARAGRAPH",
              "categories": {
                "164.308(a)(1)(ii)": {
                  "name": "Implementation specifications:",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.308(a)(1)(ii)(A)": "Risk analysis (Required). Conduct an accurate and thorough assessment of the potential risks and vulnerabilities to the confidentiality, integrity, and availability of electronic protected health information held by the covered entity or business associate.",
                    "164.308(a)(1)(ii)(B)": "Risk management (Required). Implement security measures sufficient to reduce risks and vulnerabilities to a reasonable and appropriate level to comply with  164.306(a).",
                    "164.308(a)(1)(ii)(C)": "Sanction policy (Required). Apply appropriate sanctions against workforce members who fail to comply with the security policies and procedures of the covered entity or business associate.",
                    "164.308(a)(1)(ii)(D)": "Information system activity review (Required). Implement procedures to regularly review records of information system activity, such as audit logs, access reports, and security incident tracking reports."
                  }
                }
              },
              "controls": {
                "164.308(a)(1)(i)": "Standard: Security management process. Implement policies and procedures to prevent, detect, contain, and correct security violations."
              }
            },
            "164.308(a)(3)": {
              "name": "<Included as heading for controls underneath>",
              "type": "PARAGRAPH",
              "categories": {
                "164.308(a)(3)(ii)": {
                  "name": "Implementation specifications:",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.308(a)(3)(ii)(A)": "Authorization and/or supervision (Addressable). Implement procedures for the authorization and/or supervision of workforce members who work with electronic protected health information or in locations where it might be accessed.",
                    "164.308(a)(3)(ii)(B)": "Workforce clearance procedure (Addressable). Implement procedures to determine that the access of a workforce member to electronic protected health information is appropriate.",
                    "164.308(a)(3)(ii)(C)": "Termination procedures (Addressable). Implement procedures for terminating access to electronic protected health information when the employment of, or other arrangement with, a workforce member ends or as required by determinations made as specified in paragraph (a)(3)(ii)(B) of this section."
                  }
                }
              },
              "controls": {
                "164.308(a)(3)(i)": "Standard: Workforce security. Implement policies and procedures to ensure that all members of its workforce have appropriate access to electronic protected health information, as provided under paragraph (a)(4) of this section, and to prevent those workforce members who do not have access under paragraph (a)(4) of this section from obtaining access to electronic protected health information."
              }
            },
            "164.308(a)(4)": {
              "name": "<Included as heading for controls underneath>",
              "type": "PARAGRAPH",
              "categories": {
                "164.308(a)(4)(ii)": {
                  "name": "Implementation specifications:",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.308(a)(4)(ii)(A)": "Isolating health care clearinghouse functions (Required). If a health care clearinghouse is part of a larger organization, the clearinghouse must implement policies and procedures that protect the electronic protected health information of the clearinghouse from unauthorized access by the larger organization.",
                    "164.308(a)(4)(ii)(B)": "Access authorization (Addressable). Implement policies and procedures for granting access to electronic protected health information, for example, through access to a workstation, transaction, program, process, or other mechanism.",
                    "164.308(a)(4)(ii)(C)": "Access establishment and modification (Addressable). Implement policies and procedures that, based upon the covered entity's or the business associate's access authorization policies, establish, document, review, and modify a user's right of access to a workstation, transaction, program, or process."
                  }
                }
              },
              "controls": {
                "164.308(a)(4)(i)": "Standard: Information access management. Implement policies and procedures for authorizing access to electronic protected health information that are consistent with the applicable requirements of subpart E of this part."
              }
            },
            "164.308(a)(5)": {
              "name": "<Included as heading for controls underneath>",
              "type": "PARAGRAPH",
              "categories": {
                "164.308(a)(5)(ii)": {
                  "name": "Implementation specifications: Implement:",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.308(a)(5)(ii)(A)": "Security reminders (Addressable). Periodic security updates.",
                    "164.308(a)(5)(ii)(B)": "Protection from malicious software (Addressable). Procedures for guarding against, detecting, and reporting malicious software.",
                    "164.308(a)(5)(ii)(C)": "Log-in monitoring (Addressable). Procedures for monitoring log-in attempts and reporting discrepancies.",
                    "164.308(a)(5)(ii)(D)": "Password management (Addressable). Procedures for creating, changing, and safeguarding passwords."
                  }
                }
              },
              "controls": {
                "164.308(a)(5)(i)": "Standard: Security awareness and training. Implement a security awareness and training program for all members of its workforce (including management)."
              }
            },
            "164.308(a)(6)": {
              "name": "<Included as heading for controls underneath>",
              "type": "PARAGRAPH",
              "controls": {
                "164.308(a)(6)(i)": "Standard: Security incident procedures. Implement policies and procedures to address security incidents.",
                "164.308(a)(6)(ii)": "Implementation specification: Response and reporting (Required). Identify and respond to suspected or known security incidents; mitigate, to the extent practicable, harmful effects of security incidents that are known to the covered entity or business associate; and document security incidents and their outcomes."
              }
            },
            "164.308(a)(7)": {
              "name": "<Included as heading for controls underneath>",
              "type": "PARAGRAPH",
              "categories": {
                "164.308(a)(7)(ii)": {
                  "name": "Implementation specifications:",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.308(a)(7)(ii)(A)": "Data backup plan (Required). Establish and implement procedures to create and maintain retrievable exact copies of electronic protected health information.",
                    "164.308(a)(7)(ii)(B)": "Disaster recovery plan (Required). Establish (and implement as needed) procedures to restore any loss of data.",
                    "164.308(a)(7)(ii)(C)": "Emergency mode operation plan (Required). Establish (and implement as needed) procedures to enable continuation of critical business processes for protection of the security of electronic protected health information while operating in emergency mode.",
                    "164.308(a)(7)(ii)(D)": "Testing and revision procedures (Addressable). Implement procedures for periodic testing and revision of contingency plans.",
                    "164.308(a)(7)(ii)(E)": "Applications and data criticality analysis (Addressable). Assess the relative criticality of specific applications and data in support of other contingency plan components."
                  }
                }
              },
              "controls": {
                "164.308(a)(7)(i)": "Standard: Contingency plan. Establish (and implement as needed) policies and procedures for responding to an emergency or other occurrence (for example, fire, vandalism, system failure, and natural disaster) that damages systems that contain electronic protected health information."
              }
            }
          },
          "controls": {
            "164.308(a)(2)": "Standard: Assigned security responsibility. Identify the security official who is responsible for the development and implementation of the policies and procedures required by this subpart for the covered entity or business associate.",
            "164.308(a)(8)": "Standard: Evaluation. Perform a periodic technical and nontechnical evaluation, based initially upon the standards implemented under this rule and, subsequently, in response to environmental or operational changes affecting the security of electronic protected health information, that establishes the extent to which a covered entity's or business associate's security policies and procedures meet the requirements of this subpart."
          }
        },
        "164.308(b)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "controls": {
            "164.308(b)(1)": "Business associate contracts and other arrangements. A covered entity may permit a business associate to create, receive, maintain, or transmit electronic protected health information on the covered entity's behalf only if the covered entity obtains satisfactory assurances, in accordance with § 164.314(a), that the business associate will appropriately safeguard the information. A covered entity is not required to obtain such satisfactory assurances from a business associate that is a subcontractor.",
            "164.308(b)(2)": "A business associate may permit a business associate that is a subcontractor to create, receive, maintain, or transmit electronic protected health information on its behalf only if the business associate obtains satisfactory assurances, in accordance with § 164.314(a), that the subcontractor will appropriately safeguard the information.",
            "164.308(b)(3)": "Document the satisfactory assurances required by paragraph (b)(1) or (b)(2) of this section through a written contract or other arrangement with the business associate that meets the applicable requirements of § 164.314(a)."
          }
        }
      }
    },
    "164.310": {
      "type": "SECTION",
      "name": "Physical safeguards.",
      "categories": {
        "164.310(a)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.310(a)(2)": {
              "name": "Implementation specifications:",
              "type": "PARAGRAPH",
              "controls": {
                "164.310(a)(2)(i)": "Contingency operations (Addressable). Establish (and implement as needed) procedures that allow facility access in support of restoration of lost data under the disaster recovery plan and emergency mode operations plan in the event of an emergency.",
                "164.310(a)(2)(ii)": "Facility security plan (Addressable). Implement policies and procedures to safeguard the facility and the equipment therein from unauthorized physical access, tampering, and theft.",
                "164.310(a)(2)(iii)": "Access control and validation procedures (Addressable). Implement procedures to control and validate a person's access to facilities based on their role or function, including visitor control, and control of access to software programs for testing and revision.",
                "164.310(a)(2)(iv)": "Maintenance records (Addressable). Implement policies and procedures to document repairs and modifications to the physical components of a facility which are related to security (for example, hardware, walls, doors, and locks)."
              }
            }
          },
          "controls": {
            "164.310(a)(1)": "Standard: Facility access controls. Implement policies and procedures to limit physical access to its electronic information systems and the facility or facilities in which they are housed, while ensuring that properly authorized access is allowed."
          }
        },
        "164.310(d)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.310(d)(2)": {
              "name": "Implementation specifications:",
              "type": "",
              "controls": {
                "164.310(d)(2)(i)": "Disposal (Required). Implement policies and procedures to address the final disposition of electronic protected health information, and/or the hardware or electronic media on which it is stored.",
                "164.310(d)(2)(ii)": "Media re-use (Required). Implement procedures for removal of electronic protected health information from electronic media before the media are made available for re-use.",
                "164.310(d)(2)(iii)": "Accountability (Addressable). Maintain a record of the movements of hardware and electronic media and any person responsible therefore.",
                "164.310(d)(2)(iv)": "Data backup and storage (Addressable). Create a retrievable, exact copy of electronic protected health information, when needed, before movement of equipment."
              }
            }
          },
          "controls": {
            "164.310(d)(1)": "Standard: Device and media controls. Implement policies and procedures that govern the receipt and removal of hardware and electronic media that contain electronic protected health information into and out of a facility, and the movement of these items within the facility."
          }
        }
      },
      "controls": {
        "164.310(b)": "Standard: Workstation use. Implement policies and procedures that specify the proper functions to be performed, the manner in which those functions are to be performed, and the physical attributes of the surroundings of a specific workstation or class of workstation that can access electronic protected health information.",
        "164.310(c)": "Standard: Workstation security. Implement physical safeguards for all workstations that access electronic protected health information, to restrict access to authorized users."
      }
    },
    "164.312": {
      "type": "SECTION",
      "name": "Technical safeguards.",
      "categories": {
        "164.312(a)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.312(a)(2)": {
              "name": "Implementation specifications:",
              "type": "PARAGRAPH",
              "controls": {
                "164.312(a)(2)(i)": "Unique user identification (Required). Assign a unique name and/or number for identifying and tracking user identity.",
                "164.312(a)(2)(ii)": "Emergency access procedure (Required). Establish (and implement as needed) procedures for obtaining necessary electronic protected health information during an emergency.",
                "164.312(a)(2)(iii)": "Automatic logoff (Addressable). Implement electronic procedures that terminate an electronic session after a predetermined time of inactivity.",
                "164.312(a)(2)(iv)": "Encryption and decryption (Addressable). Implement a mechanism to encrypt and decrypt electronic protected health information."
              }
            }
          },
          "controls": {
            "164.312(a)(1)": "Standard: Access control. Implement technical policies and procedures for electronic information systems that maintain electronic protected health information to allow access only to those persons or software programs that have been granted access rights as specified in § 164.308(a)(4)."
          }
        },
        "164.312(c)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "controls": {
            "164.312(c)(1)": "Standard: Integrity. Implement policies and procedures to protect electronic protected health information from improper alteration or destruction.",
            "164.312(c)(2)": "Implementation specification: Mechanism to authenticate electronic protected health information (Addressable). Implement electronic mechanisms to corroborate that electronic protected health information has not been altered or destroyed in an unauthorized manner."
          }
        },
        "164.312(e)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.312(e)(2)": {
              "name": "Implementation specifications:",
              "type": "PARAGRAPH",
              "controls": {
                "164.312(e)(2)(i)": "Integrity controls (Addressable). Implement security measures to ensure that electronically transmitted electronic protected health information is not improperly modified without detection until disposed of.",
                "164.312(e)(2)(ii)": "Encryption (Addressable). Implement a mechanism to encrypt electronic protected health information whenever deemed appropriate."
              }
            }
          },
          "controls": {
            "164.312(e)(1)": "Standard: Transmission security. Implement technical security measures to guard against unauthorized access to electronic protected health information that is being transmitted over an electronic communications network."
          }
        }
      },
      "controls": {
        "164.312(b)": "Standard: Audit controls. Implement hardware, software, and/or procedural mechanisms that record and examine activity in information systems that contain or use electronic protected health information.",
        "164.312(d)": "Standard: Person or entity authentication. Implement procedures to verify that a person or entity seeking access to electronic protected health information is the one claimed."
      }
    },
    "164.314": {
      "type": "SECTION",
      "name": "Organizational requirements.",
      "categories": {
        "164.314(a)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.314(a)(2)": {
              "name": "Implementation specifications (Required)",
              "type": "PARAGRAPH",
              "categories": {
                "164.314(a)(2)(i)": {
                  "name": "Business associate contracts. The contract must provide that the business associate will",
                  "type": "SUBPARAGRAPH",
                  "controls": {
                    "164.314(a)(2)(i)(A)": "Comply with the applicable requirements of this subpart;",
                    "164.314(a)(2)(i)(B)": "In accordance with  164.308(b)(2), ensure that any subcontractors that create, receive, maintain, or transmit electronic protected health information on behalf of the business associate agree to comply with the applicable requirements of this subpart by entering into a contract or other arrangement that complies with this section; and",
                    "164.314(a)(2)(i)(C)": "Report to the covered entity any security incident of which it becomes aware, including breaches of unsecured protected health information as required by  164.410."
                  }
                }
              },
              "controls": {
                "164.314(a)(2)(ii)": "Other arrangements. The covered entity is in compliance with paragraph (a)(1) of this section if it has another arrangement in place that meets the requirements of 164.504(e)(3).",
                "164.314(a)(2)(iii)": "Business associate contracts with subcontractors. The requirements of paragraphs (a)(2)(i) and (a)(2)(ii) of this section apply to the contract or other arrangement between a business associate and a subcontractor required by  164.308(b)(4) in the same manner as such requirements apply to contracts or other arrangements between a covered entity and business associate."
              }
            }
          },
          "controls": {
            "164.314(a)(1)": "Standard: Business associate contracts or other arrangements. The contract or other arrangement required by  164.308(b)(3) must meet the requirements of paragraph (a)(2)(i), (a)(2)(ii), or (a)(2)(iii) of this section, as applicable."
          }
        },
        "164.314(b)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.314(b)(2)": {
              "name": "Implementation specifications (Required). The plan documents of the group health plan must be amended to incorporate provisions to require the plan sponsor to",
              "type": "PARAGRAPH",
              "controls": {
                "164.314(b)(2)(i)": "Implement administrative, physical, and technical safeguards that reasonably and appropriately protect the confidentiality, integrity, and availability of the electronic protected health information that it creates, receives, maintains, or transmits on behalf of the group health plan;",
                "164.314(b)(2)(ii)": "Ensure that the adequate separation required by 164.504(f)(2)(iii) is supported by reasonable and appropriate security measures;",
                "164.314(b)(2)(iii)": "Ensure that any agent to whom it provides this information agrees to implement reasonable and appropriate security measures to protect the information; and",
                "164.314(b)(2)(iv)": "Report to the group health plan any security incident of which it becomes aware."
              }
            }
          },
          "controls": {
            "164.314(b)(1)": "Standard: Requirements for group health plans. Except when the only electronic protected health information disclosed to a plan sponsor is disclosed pursuant to 164.504(f)(1)(ii) or (iii), or as authorized under  164.508, a group health plan must ensure that its plan documents provide that the plan sponsor will reasonably and appropriately safeguard electronic protected health information created, received, maintained, or transmitted to or by the plan sponsor on behalf of the group health plan."
          }
        }
      }
    },
    "164.316": {
      "type": "SECTION",
      "name": "Policies and procedures and documentation requirements.",
      "categories": {
        "164.316(b)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "categories": {
            "164.316(b)(1)": {
              "name": "Standard: Documentation.",
              "type": "PARAGRAPH",
              "controls": {
                "164.316(b)(1)(i)": "Maintain the policies and procedures implemented to comply with this subpart in written (which may be electronic) form; and",
                "164.316(b)(1)(ii)": "If an action, activity or assessment is required by this subpart to be documented, maintain a written (which may be electronic) record of the action, activity, or assessment."
              }
            },
            "164.316(b)(2)": {
              "name": "Implementation specifications:",
              "type": "PARAGRAPH",
              "controls": {
                "164.316(b)(2)(i)": "Time limit (Required). Retain the documentation required by paragraph (b)(1) of this section for 6 years from the date of its creation or the date when it last was in effect, whichever is later.",
                "164.316(b)(2)(ii)": "Availability (Required). Make documentation available to those persons responsible for implementing the procedures to which the documentation pertains.",
                "164.316(b)(2)(iii)": "Updates (Required). Review documentation periodically, and update as needed, in response to environmental or operational changes affecting the security of the electronic protected health information."
              }
            }
          },
          "controls": {}
        }
      },
      "controls": {
        "164.316(a)": "Policies and procedures. Implement reasonable and appropriate policies and procedures to comply with the standards, implementation specifications, or other requirements of this subpart, taking into account those factors specified in § 164.306(b)(2)(i), (ii), (iii), and (iv). This standard is not to be construed to permit or excuse an action that violates any other standard, implementation specification, or other requirements of this subpart. A covered entity or business associate may change its policies and procedures at any time, provided that the changes are documented and are implemented in accordance with this subpart."
      }
    },
    "164.502": {
      "type": "SECTION",
      "name": "Uses and disclosures of protected health information: General rules.",
      "categories": {},
      "controls": {
        "164.502(b)": "Standard: Minimum necessary — Minimum necessary applies. When using or disclosing protected health information or when requesting protected health information from another covered entity or business associate, a covered entity or business associate must make reasonable efforts to limit protected health information to the minimum necessary to accomplish the intended purpose of the use, disclosure, or request."
      }
    },
    "164.530": {
      "type": "SECTION",
      "name": "Administrative requirements.",
      "categories": {
        "164.530(b)": {
          "name": "<Included as heading for controls underneath>",
          "type": "SUBSECTION",
          "controls": {
            "164.530(b)(1)": "Standard: Training.  A covered entity must train all members of its workforce on the policies and procedures with respect to protected health information required by this subpart and subpart D of this part, as necessary and appropriate for the members of the workforce to carry out their functions within the covered entity."
          }
        }
      },
      "controls": {}
    }
  }
}
