{
  "1": {
    "title": "Install and Maintain Network Security Controls",
    "subreqs": {
      "1.1": {
        "title": "Processes and mechanisms for installing and maintaining network security controls are defined and understood.",
        "defined_approaches": {
          "1.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 1 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 1 are defined, understood, and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "1.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 1 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 1 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "1.2": {
        "title": "Network security controls (NSCs) are configured and maintained.",
        "defined_approaches": {
          "1.2.1": {
            "title": "Configuration standards for NSC rulesets are: () Defined. () Implemented. () Maintained. [CUSTOMIZED APPROACH OBJECTIVE]: The way that NSCs are configured and operate are defined and consistently applied."
          },
          "1.2.2": {
            "title": "All changes to network connections and to configurations of NSCs are approved and managed in accordance with the change control process defined at Requirement 6.5.1. [CUSTOMIZED APPROACH OBJECTIVE]: Changes to network connections and NSCs cannot result in misconfiguration, implementation of insecure services, or unauthorized network connections. [APPLICABILITY NOTES]: Changes to network connections include the addition, removal, or modification of a connection. Changes to NSC configurations include those related to the component itself as well as those affecting how it performs its security function."
          },
          "1.2.3": {
            "title": "An accurate network diagram(s) is maintained that shows all connections between the CDE and other networks, including any wireless networks. [CUSTOMIZED APPROACH OBJECTIVE]: A representation of the boundaries between the CDE, all trusted networks, and all untrusted networks, is maintained and available. [APPLICABILITY NOTES]: A current network diagram(s) or other technical or topological solution that identifies network connections and devices can be used to meet this requirement."
          },
          "1.2.4": {
            "title": "An accurate data-flow diagram(s) is maintained that meets the following: () Shows all account data flows across systems and networks. () Updated as needed upon changes to the environment. [CUSTOMIZED APPROACH OBJECTIVE]: A representation of all transmissions of account data between system components and across network segments is maintained and available. [APPLICABILITY NOTES]: A data-flow diagram(s) or other technical or topological solution that identifies flows of account data across systems and networks can be used to meet this requirement."
          },
          "1.2.5": {
            "title": "All services, protocols, and ports allowed are identified, approved, and have a defined business need. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized network traffic (services, protocols, or packets destined for specific ports) cannot enter or leave the network."
          },
          "1.2.6": {
            "title": "Security features are defined and implemented for all services, protocols, and ports that are in use and considered to be insecure, such that the risk is mitigated. [CUSTOMIZED APPROACH OBJECTIVE]: The specific risks associated with the use of insecure services, protocols, and ports are understood, assessed, and appropriately mitigated."
          },
          "1.2.7": {
            "title": "Configurations of NSCs are reviewed at least once every six months to confirm they are relevant and effective. [CUSTOMIZED APPROACH OBJECTIVE]: NSC configurations that allow or restrict access to trusted networks are verified periodically to ensure that only authorized connections with a current business justification are permitted."
          },
          "1.2.8": {
            "title": "Configuration files for NSCs are: () Secured from unauthorized access. () Kept consistent with active network configurations. [CUSTOMIZED APPROACH OBJECTIVE]: NSCs cannot be defined or modified using untrusted configuration objects (including files). [APPLICABILITY NOTES]: Any file or setting used to configure or synchronize NSCs is considered to be a “configuration file.” This includes files, automated and system-based controls, scripts, settings, infrastructure as code, or other parameters that are backed up, archived, or stored remotely."
          }
        }
      },
      "1.3": {
        "title": "Network access to and from the cardholder data environment is restricted.",
        "defined_approaches": {
          "1.3.1": {
            "title": "Inbound traffic to the CDE is restricted as follows: () To only traffic that is necessary. () All other traffic is specifically denied. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized traffic cannot enter the CDE."
          },
          "1.3.2": {
            "title": "Outbound traffic from the CDE is restricted as follows: () To only traffic that is necessary. () All other traffic is specifically denied. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized traffic cannot leave the CDE."
          },
          "1.3.3": {
            "title": "NSCs are installed between all wireless networks and the CDE, regardless of whether the wireless network is a CDE, such that: () All wireless traffic from wireless networks into the CDE is denied by default. () Only wireless traffic with an authorized business purpose is allowed into the CDE. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized traffic cannot traverse network boundaries between any wireless networks and wired environments in the CDE."
          }
        }
      },
      "1.4": {
        "title": "Network connections between trusted and untrusted networks are controlled.",
        "defined_approaches": {
          "1.4.1": {
            "title": "NSCs are implemented between trusted and untrusted networks. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized traffic cannot traverse network boundaries between trusted and untrusted networks."
          },
          "1.4.2": {
            "title": "Inbound traffic from untrusted networks to trusted networks is restricted to: () Communications with system components that are authorized to provide publicly accessible services, protocols, and ports. () Stateful responses to communications initiated by system components in a trusted network. () All other traffic is denied. [CUSTOMIZED APPROACH OBJECTIVE]: Only traffic that is authorized or that is a response to a system component in the trusted network can enter a trusted network from an untrusted network. [APPLICABILITY NOTES]: The intent of this requirement is to address communication sessions between trusted and untrusted networks, rather than the specifics of protocols. This requirement does not limit the use of UDP or other connectionless network protocols if state is maintained by the NSC."
          },
          "1.4.3": {
            "title": "Anti-spoofing measures are implemented to detect and block forged source IP addresses from entering the trusted network. [CUSTOMIZED APPROACH OBJECTIVE]: Packets with forged IP source addresses cannot enter a trusted network."
          },
          "1.4.4": {
            "title": "System components that store cardholder data are not directly accessible from untrusted networks. [CUSTOMIZED APPROACH OBJECTIVE]: Stored cardholder data cannot be accessed from untrusted networks. [APPLICABILITY NOTES]: This requirement is not intended to apply to storage of account data in volatile memory but does apply where memory is being treated as persistent storage (for example, RAM disk). Account data can only be stored in volatile memory during the time necessary to support the associated business process (for example, until completion of the related payment card transaction)."
          },
          "1.4.5": {
            "title": "The disclosure of internal IP addresses and routing information is limited to only authorized parties. [CUSTOMIZED APPROACH OBJECTIVE]: Internal network information is protected from unauthorized disclosure."
          }
        }
      },
      "1.5": {
        "title": "Risks to the CDE from computing devices that are able to connect to both untrusted networks and the CDE are mitigated.",
        "defined_approaches": {
          "1.5.1": {
            "title": "Security controls are implemented on any computing devices, including company- and employee-owned devices, that connect to both untrusted networks (including the Internet) and the CDE as follows: () Specific configuration settings are defined to prevent threats being introduced into the entity’s network. () Security controls are actively running. () Security controls are not alterable by users of the computing devices unless specifically documented and authorized by management on a case-by-case basis for a limited period. [CUSTOMIZED APPROACH OBJECTIVE]: Devices that connect to untrusted environments and also connect to the CDE cannot introduce threats to the entity’s CDE. [APPLICABILITY NOTES]: These security controls may be temporarily disabled only if there is legitimate technical need, as authorized by management on a case-by-case basis. If these security controls need to be disabled for a specific purpose, it must be formally authorized. Additional security measures may also need to be implemented for the period during which these security controls are not active. This requirement applies to employee-owned and company-owned computing devices. Systems that cannot be managed by corporate policy introduce weaknesses and provide opportunities that malicious individuals may exploit."
          }
        }
      }
    }
  },
  "2": {
    "title": "Apply Secure Configurations to All System Components",
    "subreqs": {
      "2.1": {
        "title": "Processes and mechanisms for applying secure configurations to all system components are defined and understood.",
        "defined_approaches": {
          "2.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 2 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 2 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "2.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 2 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 2 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "2.2": {
        "title": "System components are configured and managed securely.",
        "defined_approaches": {
          "2.2.1": {
            "title": "Configuration standards are developed, implemented, and maintained to: () Cover all system components. () Address all known security vulnerabilities. () Be consistent with industry-accepted system hardening standards or vendor hardening recommendations. () Be updated as new vulnerability issues are identified, as defined in Requirement 6.3.1. () Be applied when new systems are configured and verified as in place before or immediately after a system component is connected to a production environment. [CUSTOMIZED APPROACH OBJECTIVE]: All system components are configured securely and consistently and in accordance with industryaccepted hardening standards or vendor recommendations."
          },
          "2.2.2": {
            "title": "Vendor default accounts are managed as follows: () If the vendor default account(s) will be used, the default password is changed per Requirement 8.3.6. () If the vendor default account(s) will not be used, the account is removed or disabled. [CUSTOMIZED APPROACH OBJECTIVE]: System components cannot be accessed using default passwords. [APPLICABILITY NOTES]: This applies to ALL vendor default accounts and passwords, including, but not limited to, those used by operating systems, software that provides security services, application and system accounts, point-of-sale (POS) terminals, payment applications, and Simple Network Management Protocol (SNMP) defaults. This requirement also applies where a system component is not installed within an entity’s environment, for example, software and applications that are part of the CDE and are accessed via a cloud subscription service."
          },
          "2.2.3": {
            "title": "Primary functions requiring different security levels are managed as follows: () Only one primary function exists on a system component, OR () Primary functions with differing security levels that exist on the same system component are isolated from each other, OR () Primary functions with differing security levels on the same system component are all secured to the level required by the function with the highest security need. [CUSTOMIZED APPROACH OBJECTIVE]: Primary functions with lower security needs cannot affect the security of primary functions with higher security needs on the same system component."
          },
          "2.2.4": {
            "title": "Only necessary services, protocols, daemons, and functions are enabled, and all unnecessary functionality is removed or disabled. [CUSTOMIZED APPROACH OBJECTIVE]: System components cannot be compromised by exploiting unnecessary functionality present in the system component."
          },
          "2.2.5": {
            "title": "If any insecure services, protocols, or daemons are present: () Business justification is documented. () Additional security features are documented and implemented that reduce the risk of using insecure services, protocols, or daemons. [CUSTOMIZED APPROACH OBJECTIVE]: System components cannot be compromised by exploiting insecure services, protocols, or daemons."
          },
          "2.2.6": {
            "title": "System security parameters are configured to prevent misuse. [CUSTOMIZED APPROACH OBJECTIVE]: System components cannot be compromised because of incorrect security parameter configuration."
          },
          "2.2.7": {
            "title": "All non-console administrative access is encrypted using strong cryptography. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext administrative authorization factors cannot be read or intercepted from any network transmissions. [APPLICABILITY NOTES]: This includes administrative access via browserbased interfaces and application programming interfaces (APIs)."
          }
        }
      },
      "2.3": {
        "title": "Wireless environments are configured and managed securely.",
        "defined_approaches": {
          "2.3.1": {
            "title": "For wireless environments connected to the CDE or transmitting account data, all wireless vendor defaults are changed at installation or are confirmed to be secure, including but not limited to: () Default wireless encryption keys. () Passwords on wireless access points. () SNMP defaults. () Any other security-related wireless vendor defaults. [CUSTOMIZED APPROACH OBJECTIVE]: Wireless networks cannot be accessed using vendor default passwords or default configurations. [APPLICABILITY NOTES]: This includes, but is not limited to, default wireless encryption keys, passwords on wireless access points, SNMP defaults, and any other securityrelated wireless vendor defaults."
          },
          "2.3.2": {
            "title": "For wireless environments connected to the CDE or transmitting account data, wireless encryption keys are changed as follows: () Whenever personnel with knowledge of the key leave the company or the role for which the knowledge was necessary. () Whenever a key is suspected of or known to be compromised. [CUSTOMIZED APPROACH OBJECTIVE]: Knowledge of wireless encryption keys cannot allow unauthorized access to wireless networks."
          }
        }
      }
    }
  },
  "3": {
    "title": "Protect Stored Account Data",
    "subreqs": {
      "3.1": {
        "title": "Processes and mechanisms for protecting stored account data are defined and understood.",
        "defined_approaches": {
          "3.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 3 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 3 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "3.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 3 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 3 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "3.2": {
        "title": "Storage of account data is kept to a minimum.",
        "defined_approaches": {
          "3.2.1": {
            "title": "Account data storage is kept to a minimum through implementation of data retention and disposal policies, procedures, and processes that include at least the following: () Coverage for all locations of stored account data. () Coverage for any sensitive authentication data (SAD) stored prior to completion of authorization. This bullet is a best practice until its effective date; refer to [APPLICABILITY NOTES]: below for details. () Limiting data storage amount and retention time to that which is required for legal or regulatory, and/or business requirements. () Specific retention requirements for stored account data that defines length of retention period and includes a documented business justification. () Processes for secure deletion or rendering account data unrecoverable when no longer needed per the retention policy. () A process for verifying, at least once every three months, that stored account data exceeding the defined retention period has been securely deleted or rendered unrecoverable. [CUSTOMIZED APPROACH OBJECTIVE]: Account data is retained only where necessary and for the least amount of time needed and is securely deleted or rendered unrecoverable when no longer needed. [APPLICABILITY NOTES]: Where account data is stored by a TPSP (for example, in a cloud environment), entities are responsible for working with their service providers to understand how the TPSP meets this requirement for the entity. Considerations include ensuring that all geographic instances of a data element are securely deleted. The bullet above (for coverage of SAD stored prior to completion of authorization) is a best practice until 31 March 2025, after which it will be required as part of Requirement 3.2.1 and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "3.3": {
        "title": "Sensitive authentication data (SAD) is not stored after authorization.",
        "defined_approaches": {
          "3.3.1": {
            "title": "SAD is not retained after authorization, even if encrypted. All sensitive authentication data received is rendered unrecoverable upon completion of the authorization process. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: This requirement does not apply to issuers and companies that support issuing services (where SAD is needed for a legitimate issuing business need) and have a business justification to store the sensitive authentication data. Refer to Requirement 3.3.3 for additional requirements specifically for issuers. Sensitive authentication data includes the data cited in Requirements 3.3.1.1 through 3.3.1.3."
          },
          "3.3.1.1": {
            "title": "The full contents of any track are not retained upon completion of the authorization process. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: In the normal course of business, the following data elements from the track may need to be retained: () Cardholder name. () Primary account number (PAN). () Expiration date. () Service code. To minimize risk, store securely only these data elements as needed for business."
          },
          "3.3.1.2": {
            "title": "The card verification code is not retained upon completion of the authorization process. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: The card verification code is the three- or four-digit number printed on the front or back of a payment card used to verify card-not-present transactions."
          },
          "3.3.1.3": {
            "title": "The personal identification number (PIN) and the PIN block are not retained upon completion of the authorization process. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: PIN blocks are encrypted during the natural course of transaction processes, but even if an entity encrypts the PIN block again, it is still not allowed to be stored after the completion of the authorization process."
          },
          "3.3.2": {
            "title": "SAD that is stored electronically prior to completion of authorization is encrypted using strong cryptography. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: Whether SAD is permitted to be stored prior to authorization is determined by the organizations that manage compliance programs (for example, payment brands and acquirers). Contact the organizations of interest for any additional criteria. This requirement applies to all storage of SAD, even if no PAN is present in the environment. Refer to Requirement 3.2.1 for an additional requirement that applies if SAD is stored prior to completion of authorization. This requirement does not apply to issuers and companies that support issuing services where there is a legitimate issuing business justification to store SAD). Refer to Requirement 3.3.3 for requirements specifically for issuers. This requirement does not replace how PIN blocks are required to be managed, nor does it mean that a properly encrypted PIN block needs to be encrypted again. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "3.3.3": {
            "title": "Additional requirement for issuers and companies that support issuing services and store sensitive authentication data: Any storage of sensitive authentication data is: () Limited to that which is needed for a legitimate issuing business need and is secured. () Encrypted using strong cryptography. This bullet is a best practice until its effective date; refer to [APPLICABILITY NOTES]: below for details. [CUSTOMIZED APPROACH OBJECTIVE]: Sensitive authentication data is retained only as required to support issuing functions and is secured from unauthorized access. [APPLICABILITY NOTES]: This requirement applies only to issuers and companies that support issuing services and store sensitive authentication data. Entities that issue payment cards or that perform or support issuing services will often create and control sensitive authentication data as part of the issuing function. It is allowable for companies that perform, facilitate, or support issuing services to store sensitive authentication data ONLY IF they have a legitimate business need to store such data. PCI DSS requirements are intended for all entities that store, process, or transmit account data, including issuers. The only exception for issuers and issuer processors is that sensitive authentication data may be retained if there is a legitimate reason to do so. Any such data must be stored securely and in accordance with all PCI DSS and specific payment brand requirements. The bullet above (for encrypting stored SAD with strong cryptography) is a best practice until 31 March 2025, after which it will be required as part of Requirement 3.3.3 and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "3.4": {
        "title": "Access to displays of full PAN and ability to copy PAN is restricted.",
        "defined_approaches": {
          "3.4.1": {
            "title": "PAN is masked when displayed (the BIN and last four digits are the maximum number of digits to be displayed), such that only personnel with a legitimate business need can see more than the BIN and last four digits of the PAN. [CUSTOMIZED APPROACH OBJECTIVE]: PAN displays are restricted to the minimum number of digits necessary to meet a defined business need. [APPLICABILITY NOTES]: This requirement does not supersede stricter requirements in place for displays of cardholder data—for example, legal or payment brand requirements for point-of-sale (POS) receipts. This requirement relates to protection of PAN where it is displayed on screens, paper receipts, printouts, etc., and is not to be confused with Requirement 3.5.1 for protection of PAN when stored, processed, or transmitted."
          },
          "3.4.2": {
            "title": "When using remote-access technologies, technical controls prevent copy and/or relocation of PAN for all personnel, except for those with documented, explicit authorization and a legitimate, defined business need. [CUSTOMIZED APPROACH OBJECTIVE]: PAN cannot be copied or relocated by unauthorized personnel using remote-access technologies. [APPLICABILITY NOTES]: Storing or relocating PAN onto local hard drives, removable electronic media, and other storage devices brings these devices into scope for PCI DSS. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "3.5": {
        "title": "Primary account number (PAN) is secured wherever it is stored.",
        "defined_approaches": {
          "3.5.1": {
            "title": "PAN is rendered unreadable anywhere it is stored by using any of the following approaches: () One-way hashes based on strong cryptography of the entire PAN. () Truncation (hashing cannot be used to replace the truncated segment of PAN). – If hashed and truncated versions of the same PAN, or different truncation formats of the same PAN, are present in an environment, additional controls are in place such that the different versions cannot be correlated to reconstruct the original PAN. () Index tokens. () Strong cryptography with associated keymanagement processes and procedures. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext PAN cannot be read from storage media. [APPLICABILITY NOTES]: It is a relatively trivial effort for a malicious individual to reconstruct original PAN data if they have access to both the truncated and hashed version of a PAN. This requirement applies to PANs stored in primary storage (databases, or flat files such as text files spreadsheets) as well as non-primary storage (backup, audit logs, exception, or troubleshooting logs) must all be protected. This requirement does not preclude the use of temporary files containing cleartext PAN while encrypting and decrypting PAN."
          },
          "3.5.1.1": {
            "title": "Hashes used to render PAN unreadable (per the first bullet of Requirement 3.5.1) are keyed cryptographic hashes of the entire PAN, with associated key-management processes and procedures in accordance with Requirements 3.6 and 3.7. [APPLICABILITY NOTES]: This requirement applies to PANs stored in primary storage (databases, or flat files such as text files spreadsheets) as well as non-primary storage (backup, audit logs, exception, or troubleshooting logs) must all be protected. This requirement does not preclude the use of temporary files containing cleartext PAN while encrypting and decrypting PAN. This requirement is considered a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "3.5.1.2": {
            "title": "If disk-level or partition-level encryption (rather than file-, column-, or field-level database encryption) is used to render PAN unreadable, it is implemented only as follows: () On removable electronic media OR () If used for non-removable electronic media, PAN is also rendered unreadable via another mechanism that meets Requirement 3.5.1. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: While disk encryption may still be present on these types of devices, it cannot be the only mechanism used to protect PAN stored on those systems. Any stored PAN must also be rendered unreadable per Requirement 3.5.1—for example, through truncation or a data-level encryption mechanism. Full disk encryption helps to protect data in the event of physical loss of a disk and therefore its use is appropriate only for removable electronic media storage devices. Media that is part of a data center architecture (for example, hot-swappable drives, bulk tape-backups) is considered non-removable electronic media to which Requirement 3.5.1 applies. Disk or partition encryption implementations must also meet all other PCI DSS encryption and keymanagement requirements. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "3.5.1.3": {
            "title": "If disk-level or partition-level encryption is used (rather than file-, column-, or field--level database encryption) to render PAN unreadable, it is managed as follows: () Logical access is managed separately and independently of native operating system authentication and access control mechanisms. () Decryption keys are not associated with user accounts. () Authentication factors (passwords, passphrases, or cryptographic keys) that allow access to unencrypted data are stored securely. [CUSTOMIZED APPROACH OBJECTIVE]: Disk encryption implementations are configured to require independent authentication and logical access controls for decryption. [APPLICABILITY NOTES]: Disk or partition encryption implementations must also meet all other PCI DSS encryption and keymanagement requirements."
          }
        }
      },
      "3.6": {
        "title": "Cryptographic keys used to protect stored account data are secured.",
        "defined_approaches": {
          "3.6.1": {
            "title": "Procedures are defined and implemented to protect cryptographic keys used to protect stored account data against disclosure and misuse that include: () Access to keys is restricted to the fewest number of custodians necessary. () Key-encrypting keys are at least as strong as the data-encrypting keys they protect. () Key-encrypting keys are stored separately from data-encrypting keys. () Keys are stored securely in the fewest possible locations and forms. [CUSTOMIZED APPROACH OBJECTIVE]: Processes that protect cryptographic keys used to protect stored account data against disclosure and misuse are defined and implemented. [APPLICABILITY NOTES]: This requirement applies to keys used to encrypt stored account data and to key-encrypting keys used to protect data-encrypting keys. The requirement to protect keys used to protect stored account data from disclosure and misuse applies to both data-encrypting keys and keyencrypting keys. Because one key-encrypting key may grant access to many data-encrypting keys, the key-encrypting keys require strong protection measures."
          },
          "3.6.1.1": {
            "title": "Additional requirement for service providers only: A documented description of the cryptographic architecture is maintained that includes: () Details of all algorithms, protocols, and keys used for the protection of stored account data, including key strength and expiry date. () Preventing the use of the same cryptographic keys in production and test environments. This bullet is a best practice until its effective date; refer to [APPLICABILITY NOTES]: below for details. () Description of the key usage for each key. () Inventory of any hardware security modules (HSMs), key management systems (KMS), and other secure cryptographic devices (SCDs) used for key management, including type and location of devices, as outlined in Requirement 12.3.4. [CUSTOMIZED APPROACH OBJECTIVE]: Accurate details of the cryptographic architecture are maintained and available. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. In cloud HSM implementations, responsibility for the cryptographic architecture according to this Requirement will be shared between the cloud provider and the cloud customer. The bullet above (for including, in the cryptographic architecture, that the use of the same cryptographic keys in production and test is prevented) is a best practice until 31 March 2025, after which it will be required as part of Requirement 3.6.1.1 and must be fully considered during a PCI DSS assessment."
          },
          "3.6.1.2": {
            "title": "Secret and private keys used to encrypt/decrypt stored account data are stored in one (or more) of the following forms at all times: () Encrypted with a key-encrypting key that is at least as strong as the data-encrypting key, and that is stored separately from the dataencrypting key. () Within a secure cryptographic device (SCD), such as a hardware security module (HSM) or PTS-approved point-of-interaction device. () As at least two full-length key components or key shares, in accordance with an industry-accepted method. [CUSTOMIZED APPROACH OBJECTIVE]: Secret and private keys are stored in a secure form that prevents unauthorized retrieval or access. [APPLICABILITY NOTES]: It is not required that public keys be stored in one of these forms. Cryptographic keys stored as part of a key management system (KMS) that employs SCDs are acceptable. A cryptographic key that is split into two parts does not meet this requirement. Secret or private keys stored as key components or key shares must be generated via one of the following: () Using an approved random number generator and within an SCD, OR () According to ISO 19592 or equivalent industry standard for generation of secret key shares."
          },
          "3.6.1.3": {
            "title": "Access to cleartext cryptographic key components is restricted to the fewest number of custodians necessary. [CUSTOMIZED APPROACH OBJECTIVE]: Access to cleartext cryptographic key components is restricted to necessary personnel."
          },
          "3.6.1.4": {
            "title": "Cryptographic keys are stored in the fewest possible locations. [CUSTOMIZED APPROACH OBJECTIVE]: Cryptographic keys are retained only where necessary."
          }
        }
      },
      "3.7": {
        "title": "Where cryptography is used to protect stored account data, key management processes and procedures covering all aspects of the key lifecycle are defined and implemented.",
        "defined_approaches": {
          "3.7.1": {
            "title": "Key-management policies and procedures are implemented to include generation of strong cryptographic keys used to protect stored account data. [CUSTOMIZED APPROACH OBJECTIVE]: Strong cryptographic keys are generated."
          },
          "3.7.2": {
            "title": "Key-management policies and procedures are implemented to include secure distribution of cryptographic keys used to protect stored account data. [CUSTOMIZED APPROACH OBJECTIVE]: Cryptographic keys are secured during distribution."
          },
          "3.7.3": {
            "title": "Key-management policies and procedures are implemented to include secure storage of cryptographic keys used to protect stored account data. [CUSTOMIZED APPROACH OBJECTIVE]: Cryptographic keys are secured when stored."
          },
          "3.7.4": {
            "title": "Key management policies and procedures are implemented for cryptographic key changes for keys that have reached the end of their cryptoperiod, as defined by the associated application vendor or key owner, and based on industry best practices and guidelines, including the following: () A defined cryptoperiod for each key type in use. () A process for key changes at the end of the defined cryptoperiod. [CUSTOMIZED APPROACH OBJECTIVE]: Cryptographic keys are not used beyond their defined cryptoperiod."
          },
          "3.7.5": {
            "title": "Key management policies procedures are implemented to include the retirement, replacement, or destruction of keys used to protect stored account data, as deemed necessary when: () The key has reached the end of its defined cryptoperiod. () The integrity of the key has been weakened, including when personnel with knowledge of a cleartext key component leaves the company, or the role for which the key component was known. () The key is suspected of or known to be compromised. Retired or replaced keys are not used for encryption operations. [CUSTOMIZED APPROACH OBJECTIVE]: Keys are removed from active use when it is suspected or known that the integrity of the key is weakened. [APPLICABILITY NOTES]: If retired or replaced cryptographic keys need to be retained, these keys must be securely archived (for example, by using a key-encryption key)."
          },
          "3.7.6": {
            "title": "Where manual cleartext cryptographic keymanagement operations are performed by personnel, key-management policies and procedures are implemented include managing these operations using split knowledge and dual control. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext secret or private keys cannot be known by anyone. Operations involving cleartext keys cannot be carried out by a single person. [APPLICABILITY NOTES]: This control is applicable for manual keymanagement operations or where key management is not controlled by the encryption product. A cryptographic key that is simply split into two parts does not meet this requirement. Secret or private keys stored as key components or key shares must be generated via one of the following: () Using an approved random number generator and within a secure cryptographic device (SCD), such as a hardware security module (HSM) or PTS-approved point-of-interaction device, OR () According to ISO 19592 or equivalent industry standard for generation of secret key shares."
          },
          "3.7.7": {
            "title": "Key management policies and procedures are implemented to include the prevention of unauthorized substitution of cryptographic keys. [CUSTOMIZED APPROACH OBJECTIVE]: Cryptographic keys cannot be substituted by unauthorized personnel."
          },
          "3.7.8": {
            "title": "Key management policies and procedures are implemented to include that cryptographic key custodians formally acknowledge (in writing or electronically) that they understand and accept their key-custodian responsibilities. [CUSTOMIZED APPROACH OBJECTIVE]: Key custodians are knowledgeable about their responsibilities in relation to cryptographic operations and can access assistance and guidance when required."
          },
          "3.7.9": {
            "title": "Additional requirement for service providers only: Where a service provider shares cryptographic keys with its customers for transmission or storage of account data, guidance on secure transmission, storage and updating of such keys is documented and distributed to the service provider’s customers. [CUSTOMIZED APPROACH OBJECTIVE]: Customers are provided with appropriate key management guidance whenever they receive shared cryptographic keys. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider."
          }
        }
      }
    }
  },
  "4": {
    "title": "Protect Cardholder Data with Strong Cryptography During Transmission Over Open, Public Networks",
    "subreqs": {
      "4.1": {
        "title": "Processes and mechanisms for protecting cardholder data with strong cryptography during transmission over open, public networks are defined and documented.",
        "defined_approaches": {
          "4.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 4 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 4 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "4.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 4 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 4 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "4.2": {
        "title": "PAN is protected with strong cryptography during transmission.",
        "defined_approaches": {
          "4.2.1": {
            "title": "Strong cryptography and security protocols are implemented as follows to safeguard PAN during transmission over open, public networks: () Only trusted keys and certificates are accepted. () Certificates used to safeguard PAN during transmission over open, public networks are confirmed as valid and are not expired or revoked. This bullet is a best practice until its effective date; refer to [APPLICABILITY NOTES]: below for details. () The protocol in use supports only secure versions or configurations and does not support fallback to, or use of insecure versions, algorithms, key sizes, or implementations. () The encryption strength is appropriate for the encryption methodology in use. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext PAN cannot be read or intercepted from any transmissions over open, public networks. [APPLICABILITY NOTES]: There could be occurrences where an entity receives cardholder data unsolicited via an insecure communication channel that was not intended for the purpose of receiving sensitive data. In this situation, the entity can choose to either include the channel in the scope of their CDE and secure it according to PCI DSS or implement measures to prevent the channel from being used for cardholder data. A self-signed certificate may also be acceptable if the certificate is issued by an internal CA within the organization, the certificate’s author is confirmed, and the certificate is verified—for example, via hash or signature—and has not expired. Note that selfsigned certificates where the Distinguished Name (DN) field in the “issued by” and “issued to” field is the same are not acceptable. The bullet above (for confirming that certificates used to safeguard PAN during transmission over open, public networks are valid and are not expired or revoked) is a best practice until 31 March 2025, after which it will be required as part of Requirement 4.2.1 and must be fully considered during a PCI DSS assessment."
          },
          "4.2.1.1": {
            "title": "An inventory of the entity’s trusted keys and certificates used to protect PAN during transmission is maintained. [CUSTOMIZED APPROACH OBJECTIVE]: All keys and certificates used to protect PAN during transmission are identified and confirmed as trusted. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "4.2.1.2": {
            "title": "Wireless networks transmitting PAN or connected to the CDE use industry best practices to implement strong cryptography for authentication and transmission. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext PAN cannot be read or intercepted from wireless network transmissions."
          },
          "4.2.2": {
            "title": "PAN is secured with strong cryptography whenever it is sent via end-user messaging technologies. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext PAN cannot be read or intercepted from transmissions using end-user messaging technologies. [APPLICABILITY NOTES]: This requirement also applies if a customer, or other third-party, requests that PAN is sent to them via end-user messaging technologies. There could be occurrences where an entity receives unsolicited cardholder data via an insecure communication channel that was not intended for transmissions of sensitive data. In this situation, the entity can choose to either include the channel in the scope of their CDE and secure it according to PCI DSS or delete the cardholder data and implement measures to prevent the channel from being used for cardholder data."
          }
        }
      }
    }
  },
  "5": {
    "title": "Protect All Systems and Networks from Malicious Software",
    "subreqs": {
      "5.1": {
        "title": "Processes and mechanisms for protecting all systems and networks from malicious software are defined and understood.",
        "defined_approaches": {
          "5.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 5 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 5 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "5.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 5 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 5 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "5.2": {
        "title": "Malicious software (malware) is prevented, or detected and addressed.",
        "defined_approaches": {
          "5.2.1": {
            "title": "An anti-malware solution(s) is deployed on all system components, except for those system components identified in periodic evaluations per Requirement 5.2.3 that concludes the system components are not at risk from malware. [CUSTOMIZED APPROACH OBJECTIVE]: Automated mechanisms are implemented to prevent systems from becoming an attack vector for malware."
          },
          "5.2.2": {
            "title": "The deployed anti-malware solution(s): () Detects all known types of malware. () Removes, blocks, or contains all known types of malware. [CUSTOMIZED APPROACH OBJECTIVE]: Malware cannot execute or infect other system components."
          },
          "5.2.3": {
            "title": "Any system components that are not at risk for malware are evaluated periodically to include the following: () A documented list of all system components not at risk for malware. () Identification and evaluation of evolving malware threats for those system components. () Confirmation whether such system components continue to not require anti-malware protection. [CUSTOMIZED APPROACH OBJECTIVE]: The entity maintains awareness of evolving malware threats to ensure that any systems not protected from malware are not at risk of infection. [APPLICABILITY NOTES]: System components covered by this requirement are those for which there is no anti-malware solution deployed per Requirement 5.2.1."
          },
          "5.2.3.1": {
            "title": "The frequency of periodic evaluations of system components identified as not at risk for malware is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1. [CUSTOMIZED APPROACH OBJECTIVE]: Systems not known to be at risk from malware are re-evaluated at a frequency that addresses the entity’s risk. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "5.3": {
        "title": "Anti-malware mechanisms and processes are active, maintained, and monitored.",
        "defined_approaches": {
          "5.3.1": {
            "title": "The anti-malware solution(s) is kept current via automatic updates. [CUSTOMIZED APPROACH OBJECTIVE]: Anti-malware mechanisms can detect and address the latest malware threats."
          },
          "5.3.2": {
            "title": "The anti-malware solution(s): () Performs periodic scans and active or real-time scans. OR () Performs continuous behavioral analysis of systems or processes. [CUSTOMIZED APPROACH OBJECTIVE]: Malware cannot complete execution."
          },
          "5.3.2.1": {
            "title": "If periodic malware scans are performed to meet Requirement 5.3.2, the frequency of scans is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1. [CUSTOMIZED APPROACH OBJECTIVE]: Scans by the malware solution are performed at a frequency that addresses the entity’s risk. [APPLICABILITY NOTES]: This requirement applies to entities conducting periodic malware scans to meet Requirement 5.3.2. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "5.3.3": {
            "title": "For removable electronic media, the antimalware solution(s): () Performs automatic scans of when the media is inserted, connected, or logically mounted, OR () Performs continuous behavioral analysis of systems or processes when the media is inserted, connected, or logically mounted. [CUSTOMIZED APPROACH OBJECTIVE]: Malware cannot be introduced to system components via external removable media. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "5.3.4": {
            "title": "Audit logs for the anti-malware solution(s) are enabled and retained in accordance with Requirement 10.5.1. [CUSTOMIZED APPROACH OBJECTIVE]: Historical records of anti-malware actions are immediately available and retained for at least 12 months."
          },
          "5.3.5": {
            "title": "Anti-malware mechanisms cannot be disabled or altered by users, unless specifically documented, and authorized by management on a case-by-case basis for a limited time period. [CUSTOMIZED APPROACH OBJECTIVE]: Anti-malware mechanisms cannot be modified by unauthorized personnel. [APPLICABILITY NOTES]: Anti-malware solutions may be temporarily disabled only if there is a legitimate technical need, as authorized by management on a case-by-case basis. If anti-malware protection needs to be disabled for a specific purpose, it must be formally authorized. Additional security measures may also need to be implemented for the period during which anti-malware protection is not active."
          }
        }
      },
      "5.4": {
        "title": "Anti-phishing mechanisms protect users against phishing attacks.",
        "defined_approaches": {
          "5.4.1": {
            "title": "Processes and automated mechanisms are in place to detect and protect personnel against phishing attacks. [CUSTOMIZED APPROACH OBJECTIVE]: Mechanisms are in place to protect against and mitigate risk posed by phishing attacks. [APPLICABILITY NOTES]: This requirement applies to the automated mechanism. It is not intended that the systems and services providing such automated mechanisms (such as email servers) are brought into scope for PCI DSS. The focus of this requirement is on protecting personnel with access to system components inscope for PCI DSS. Meeting this requirement for technical and automated controls to detect and protect personnel against phishing is not the same as Requirement 12.6.3.1 for security awareness training. Meeting this requirement does not also meet the requirement for providing personnel with security awareness training, and vice versa. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      }
    }
  },
  "6": {
    "title": "Develop and Maintain Secure Systems and Software",
    "subreqs": {
      "6.1": {
        "title": "Processes and mechanisms for developing and maintaining secure systems and software are defined and understood.",
        "defined_approaches": {
          "6.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 6 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 6 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "6.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 6 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 6 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "6.2": {
        "title": "Bespoke and custom software are developed securely.",
        "defined_approaches": {
          "6.2.1": {
            "title": "Bespoke and custom software are developed securely, as follows: () Based on industry standards and/or best practices for secure development. () In accordance with PCI DSS (for example, secure authentication and logging). () Incorporating consideration of information security issues during each stage of the software development lifecycle. [CUSTOMIZED APPROACH OBJECTIVE]: Bespoke and custom software is developed in accordance with PCI DSS and secure development processes throughout the software lifecycle. [APPLICABILITY NOTES]: This applies to all software developed for or by the entity for the entity’s own use. This includes both bespoke and custom software. This does not apply to third-party software."
          },
          "6.2.2": {
            "title": "Software development personnel working on bespoke and custom software are trained at least once every 12 months as follows: () On software security relevant to their job function and development languages. () Including secure software design and secure coding techniques. () Including, if security testing tools are used, how to use the tools for detecting vulnerabilities in software. [CUSTOMIZED APPROACH OBJECTIVE]: Software development personnel remain knowledgeable about secure development practices; software security; and attacks against the languages, frameworks, or applications they develop. Personnel are able to access assistance and guidance when required."
          },
          "6.2.3": {
            "title": "Bespoke and custom software is reviewed prior to being released into production or to customers, to identify and correct potential coding vulnerabilities, as follows: () Code reviews ensure code is developed according to secure coding guidelines. () Code reviews look for both existing and emerging software vulnerabilities. () Appropriate corrections are implemented prior to release. [CUSTOMIZED APPROACH OBJECTIVE]: Bespoke and custom software cannot be exploited via coding vulnerabilities. [APPLICABILITY NOTES]: This requirement for code reviews applies to all bespoke and custom software (both internal and public-facing), as part of the system development lifecycle. Public-facing web applications are also subject to additional controls, to address ongoing threats and vulnerabilities after implementation, as defined at PCI DSS Requirement 6.4. Code reviews may be performed using either manual or automated processes, or a combination of both."
          },
          "6.2.3.1": {
            "title": "If manual code reviews are performed for bespoke and custom software prior to release to production, code changes are: () Reviewed by individuals other than the originating code author, and who are knowledgeable about code-review techniques and secure coding practices. () Reviewed and approved by management prior to release. [CUSTOMIZED APPROACH OBJECTIVE]: The manual code review process cannot be bypassed and is effective at discovering security vulnerabilities. [APPLICABILITY NOTES]: Manual code reviews can be conducted by knowledgeable internal personnel or knowledgeable third-party personnel. An individual that has been formally granted accountability for release control and who is neither the original code author nor the code reviewer fulfills the criteria of being management."
          },
          "6.2.4": {
            "title": "Software engineering techniques or other methods are defined and in use by software development personnel to prevent or mitigate common software attacks and related vulnerabilities in bespoke and custom software, including but not limited to the following: () Injection attacks, including SQL, LDAP, XPath, or other command, parameter, object, fault, or injection-type flaws. () Attacks on data and data structures, including attempts to manipulate buffers, pointers, input data, or shared data. () Attacks on cryptography usage, including attempts to exploit weak, insecure, or inappropriate cryptographic implementations, algorithms, cipher suites, or modes of operation. () Attacks on business logic, including attempts to abuse or bypass application features and functionalities through the manipulation of APIs, communication protocols and channels, clientside functionality, or other system/application functions and resources. This includes cross-site scripting (XSS) and cross-site request forgery (CSRF). () Attacks on access control mechanisms, including attempts to bypass or abuse identification, authentication, or authorization mechanisms, or attempts to exploit weaknesses in the implementation of such mechanisms. () Attacks via any “high-risk” vulnerabilities identified in the vulnerability identification process, as defined in Requirement 6.3.1. [CUSTOMIZED APPROACH OBJECTIVE]: Bespoke and custom software cannot be exploited via common attacks and related vulnerabilities. [APPLICABILITY NOTES]: This applies to all software developed for or by the entity for the entity’s own use. This includes both bespoke and custom software. This does not apply to third-party software."
          }
        }
      },
      "6.3": {
        "title": "Security vulnerabilities are identified and addressed.",
        "defined_approaches": {
          "6.3.1": {
            "title": "Security vulnerabilities are identified and managed as follows: () New security vulnerabilities are identified using industry-recognized sources for security vulnerability information, including alerts from international and national computer emergency response teams (CERTs). () Vulnerabilities are assigned a risk ranking based on industry best practices and consideration of potential impact. () Risk rankings identify, at a minimum, all vulnerabilities considered to be a high-risk or critical to the environment. () Vulnerabilities for bespoke and custom, and third-party software (for example operating systems and databases) are covered. [CUSTOMIZED APPROACH OBJECTIVE]: New system and software vulnerabilities that may impact the security of account data or the CDE are monitored, cataloged, and risk assessed. [APPLICABILITY NOTES]: This requirement is not achieved by, nor is it the same as, vulnerability scans performed for Requirements 11.3.1 and 11.3.2. This requirement is for a process to actively monitor industry sources for vulnerability information and for the entity to determine the risk ranking to be associated with each vulnerability."
          },
          "6.3.2": {
            "title": "An inventory of bespoke and custom software, and third-party software components incorporated into bespoke and custom software is maintained to facilitate vulnerability and patch management. [CUSTOMIZED APPROACH OBJECTIVE]: Known vulnerabilities in third-party software components cannot be exploited in bespoke and custom software. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "6.3.3": {
            "title": "All system components are protected from known vulnerabilities by installing applicable security patches/updates as follows: () Critical or high-security patches/updates (identified according to the risk ranking process at Requirement 6.3.1) are installed within one month of release. () All other applicable security patches/updates are installed within an appropriate time frame as determined by the entity (for example, within three months of release). [CUSTOMIZED APPROACH OBJECTIVE]: System components cannot be compromised via the exploitation of a known vulnerability."
          }
        }
      },
      "6.4": {
        "title": "Public-facing web applications are protected against attacks.",
        "defined_approaches": {
          "6.4.1": {
            "title": "For public-facing web applications, new threats and vulnerabilities are addressed on an ongoing basis and these applications are protected against known attacks as follows: () Reviewing public-facing web applications via manual or automated application vulnerability security assessment tools or methods as follows: – At least once every 12 months and after significant changes. – By an entity that specializes in application security. – Including, at a minimum, all common software attacks in Requirement 6.2.4. – All vulnerabilities are ranked in accordance with requirement 6.3.1. – All vulnerabilities are corrected. – The application is re-evaluated after the corrections OR () Installing an automated technical solution(s) that continually detects and prevents web-based attacks as follows: – Installed in front of public-facing web applications to detect and prevent webbased attacks. – Actively running and up to date as applicable. – Generating audit logs. – Configured to either block web-based attacks or generate an alert that is immediately investigated. [CUSTOMIZED APPROACH OBJECTIVE]: Public-facing web applications are protected against malicious attacks. [APPLICABILITY NOTES]: This assessment is not the same as the vulnerability scans performed for Requirement 11.3.1 and 11.3.2. This requirement will be superseded by Requirement 6.4.2 after 31 March 2025 when Requirement 6.4.2 becomes effective."
          },
          "6.4.2": {
            "title": "For public-facing web applications, an automated technical solution is deployed that continually detects and prevents web-based attacks, with at least the following: () Is installed in front of public-facing web applications and is configured to detect and prevent web-based attacks. () Actively running and up to date as applicable. () Generating audit logs. () Configured to either block web-based attacks or generate an alert that is immediately investigated. [CUSTOMIZED APPROACH OBJECTIVE]: Public-facing web applications are protected in real time against malicious attacks. [APPLICABILITY NOTES]: This new requirement will replace Requirement 6.4.1 once its effective date is reached. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "6.4.3": {
            "title": "All payment page scripts that are loaded and executed in the consumer’s browser are managed as follows: () A method is implemented to confirm that each script is authorized. () A method is implemented to assure the integrity of each script. () An inventory of all scripts is maintained with written justification as to why each is necessary. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized code cannot be present in the payment page as it is rendered in the consumer’s browser. [APPLICABILITY NOTES]: This requirement applies to all scripts loaded from the entity’s environment and scripts loaded from third and fourth parties. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "6.5": {
        "title": "Changes to all system components are managed securely.",
        "defined_approaches": {
          "6.5.1": {
            "title": "Changes to all system components in the production environment are made according to established procedures that include: () Reason for, and description of, the change. () Documentation of security impact. () Documented change approval by authorized parties. () Testing to verify that the change does not adversely impact system security. () For bespoke and custom software changes, all updates are tested for compliance with Requirement 6.2.4 before being deployed into production. () Procedures to address failures and return to a secure state. [CUSTOMIZED APPROACH OBJECTIVE]: All changes are tracked, authorized, and evaluated for impact and security, and changes are managed to avoid unintended effects to the security of system components."
          },
          "6.5.2": {
            "title": "Upon completion of a significant change, all applicable PCI DSS requirements are confirmed to be in place on all new or changed systems and networks, and documentation is updated as applicable. [CUSTOMIZED APPROACH OBJECTIVE]: All system components are verified after a significant change to be compliant with the applicable PCI DSS requirements. [APPLICABILITY NOTES]: These significant changes should also be captured and reflected in the entity’s annual PCI DSS scope confirmation activity per Requirement 12.5.2."
          },
          "6.5.3": {
            "title": "Pre-production environments are separated from production environments and the separation is enforced with access controls. [CUSTOMIZED APPROACH OBJECTIVE]: Pre-production environments cannot introduce risks and vulnerabilities into production environments."
          },
          "6.5.4": {
            "title": "Roles and functions are separated between production and pre-production environments to provide accountability such that only reviewed and approved changes are deployed. [CUSTOMIZED APPROACH OBJECTIVE]: Job roles and accountability that differentiate between pre-production and production activities are defined and managed to minimize the risk of unauthorized, unintentional, or inappropriate actions. [APPLICABILITY NOTES]: In environments with limited personnel where individuals perform multiple roles or functions, this same goal can be achieved with additional procedural controls that provide accountability. For example, a developer may also be an administrator that uses an administrator-level account with elevated privileges in the development environment and, for their developer role, they use a separate account with user-level access to the production environment."
          },
          "6.5.5": {
            "title": "Live PANs are not used in pre-production environments, except where those environments are included in the CDE and protected in accordance with all applicable PCI DSS requirements. [CUSTOMIZED APPROACH OBJECTIVE]: Live PANs cannot be present in pre-production environments outside the CDE."
          },
          "6.5.6": {
            "title": "Test data and test accounts are removed from system components before the system goes into production. [CUSTOMIZED APPROACH OBJECTIVE]: Test data and test accounts cannot exist in production environments."
          }
        }
      }
    }
  },
  "7": {
    "title": "Restrict Access to System Components and Cardholder Data by Business Need to Know",
    "subreqs": {
      "7.1": {
        "title": "Processes and mechanisms for restricting access to system components and cardholder data by business need to know are defined and understood.",
        "defined_approaches": {
          "7.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 7 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 7 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "7.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 7 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 7 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "7.2": {
        "title": "Access to system components and data is appropriately defined and assigned.",
        "defined_approaches": {
          "7.2.1": {
            "title": "An access control model is defined and includes granting access as follows: () Appropriate access depending on the entity’s business and access needs. () Access to system components and data resources that is based on users’ job classification and functions. () The least privileges required (for example, user, administrator) to perform a job function. [CUSTOMIZED APPROACH OBJECTIVE]: Access requirements are established according to job functions following least-privilege and need-toknow principles."
          },
          "7.2.2": {
            "title": "Access is assigned to users, including privileged users, based on: () Job classification and function. () Least privileges necessary to perform job responsibilities. [CUSTOMIZED APPROACH OBJECTIVE]: Access to systems and data is limited to only the access needed to perform job functions, as defined in the related access roles."
          },
          "7.2.3": {
            "title": "Required privileges are approved by authorized personnel. [CUSTOMIZED APPROACH OBJECTIVE]: Access privileges cannot be granted to users without appropriate, documented authorization."
          },
          "7.2.4": {
            "title": "All user accounts and related access privileges, including third-party/vendor accounts, are reviewed as follows: () At least once every six months. () To ensure user accounts and access remain appropriate based on job function. () Any inappropriate access is addressed. () Management acknowledges that access remains appropriate. [CUSTOMIZED APPROACH OBJECTIVE]: Account privilege assignments are verified periodically by management as correct, and nonconformities are remediated. [APPLICABILITY NOTES]: This requirement applies to all user accounts and related access privileges, including those used by personnel and third parties/vendors, and accounts used to access third-party cloud services. See Requirements 7.2.5 and 7.2.5.1 and 8.6.1 through 8.6.3 for controls for application and system accounts. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "7.2.5": {
            "title": "All application and system accounts and related access privileges are assigned and managed as follows: () Based on the least privileges necessary for the operability of the system or application. () Access is limited to the systems, applications, or processes that specifically require their use. [CUSTOMIZED APPROACH OBJECTIVE]: Access rights granted to application and system accounts are limited to only the access needed for the operability of that application or system. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "7.2.5.1": {
            "title": "All access by application and system accounts and related access privileges are reviewed as follows: () Periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1). () The application/system access remains appropriate for the function being performed. () Any inappropriate access is addressed. () Management acknowledges that access remains appropriate. [CUSTOMIZED APPROACH OBJECTIVE]: Application and system account privilege assignments are verified periodically by management as correct, and nonconformities are remediated. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "7.2.6": {
            "title": "All user access to query repositories of stored cardholder data is restricted as follows: () Via applications or other programmatic methods, with access and allowed actions based on user roles and least privileges. () Only the responsible administrator(s) can directly access or query repositories of stored CHD. [CUSTOMIZED APPROACH OBJECTIVE]: Direct unfiltered (ad hoc) query access to cardholder data repositories is prohibited, unless performed by an authorized administrator. [APPLICABILITY NOTES]: This requirement applies to controls for user access to query repositories of stored cardholder data. See Requirements 7.2.5 and 7.2.5.1 and 8.6.1 through 8.6.3 for controls for application and system accounts."
          }
        }
      },
      "7.3": {
        "title": "Access to system components and data is managed via an access control system(s).",
        "defined_approaches": {
          "7.3.1": {
            "title": "An access control system(s) is in place that restricts access based on a user’s need to know and covers all system components. [CUSTOMIZED APPROACH OBJECTIVE]: Access rights and privileges are managed via mechanisms intended for that purpose."
          },
          "7.3.2": {
            "title": "The access control system(s) is configured to enforce permissions assigned to individuals, applications, and systems based on job classification and function. [CUSTOMIZED APPROACH OBJECTIVE]: Individual account access rights and privileges to systems, applications, and data are only inherited from group membership."
          },
          "7.3.3": {
            "title": "The access control system(s) is set to “deny all” by default. [CUSTOMIZED APPROACH OBJECTIVE]: Access rights and privileges are prohibited unless expressly permitted."
          }
        }
      }
    }
  },
  "8": {
    "title": "Identify Users and Authenticate Access to System Components",
    "subreqs": {
      "8.1": {
        "title": "Processes and mechanisms for identifying users and authenticating access to system components are defined and understood.",
        "defined_approaches": {
          "8.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 8 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 8 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "8.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 8 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 8 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "8.2": {
        "title": "User identification and related accounts for users and administrators are strictly managed throughout an account’s lifecycle.",
        "defined_approaches": {
          "8.2.1": {
            "title": "All users are assigned a unique ID before access to system components or cardholder data is allowed. [CUSTOMIZED APPROACH OBJECTIVE]: All actions by all users are attributable to an individual. [APPLICABILITY NOTES]: This requirement is not intended to apply to user accounts within point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals)."
          },
          "8.2.2": {
            "title": "Group, shared, or generic accounts, or other shared authentication credentials are only used when necessary on an exception basis, and are managed as follows: () Account use is prevented unless needed for an exceptional circumstance. () Use is limited to the time needed for the exceptional circumstance. () Business justification for use is documented. () Use is explicitly approved by management. () Individual user identity is confirmed before access to an account is granted. () Every action taken is attributable to an individual user. [CUSTOMIZED APPROACH OBJECTIVE]: All actions performed by users with generic, system, or shared IDs are attributable to an individual person. [APPLICABILITY NOTES]: This requirement is not intended to apply to user accounts within point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals)."
          },
          "8.2.3": {
            "title": "Additional requirement for service providers only: Service providers with remote access to customer premises use unique authentication factors for each customer premises. [CUSTOMIZED APPROACH OBJECTIVE]: A service provider’s credential used for one customer cannot be used for any other customer. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement is not intended to apply to service providers accessing their own shared services environments, where multiple customer environments are hosted. If service provider employees use shared authentication factors to remotely access customer premises, these factors must be unique per customer and managed in accordance with Requirement 8.2.2."
          },
          "8.2.4": {
            "title": "Addition, deletion, and modification of user IDs, authentication factors, and other identifier objects are managed as follows: () Authorized with the appropriate approval. () Implemented with only the privileges specified on the documented approval. [CUSTOMIZED APPROACH OBJECTIVE]: Lifecycle events for user IDs and authentication factors cannot occur without appropriate authorization. [APPLICABILITY NOTES]: This requirement applies to all user accounts, including employees, contractors, consultants, temporary workers, and third-party vendors."
          },
          "8.2.5": {
            "title": "Access for terminated users is immediately revoked. [CUSTOMIZED APPROACH OBJECTIVE]: The accounts of terminated users cannot be used."
          },
          "8.2.6": {
            "title": "Inactive user accounts are removed or disabled within 90 days of inactivity. [CUSTOMIZED APPROACH OBJECTIVE]: Inactive user accounts cannot be used."
          },
          "8.2.7": {
            "title": "Accounts used by third parties to access, support, or maintain system components via remote access are managed as follows: () Enabled only during the time period needed and disabled when not in use. () Use is monitored for unexpected activity. [CUSTOMIZED APPROACH OBJECTIVE]: Third party remote access cannot be used except where specifically authorized and use is overseen by management."
          },
          "8.2.8": {
            "title": "If a user session has been idle for more than 15 minutes, the user is required to re-authenticate to re-activate the terminal or session. [CUSTOMIZED APPROACH OBJECTIVE]: A user session cannot be used except by the authorized user. [APPLICABILITY NOTES]: This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals). This requirement is not meant to prevent legitimate activities from being performed while the console/PC is unattended."
          }
        }
      },
      "8.3": {
        "title": "Strong authentication for users and administrators is established and managed.",
        "defined_approaches": {
          "8.3.1": {
            "title": "All user access to system components for users and administrators is authenticated via at least one of the following authentication factors: () Something you know, such as a password or passphrase. () Something you have, such as a token device or smart card. () Something you are, such as a biometric element. [CUSTOMIZED APPROACH OBJECTIVE]: An account cannot be accessed except with a combination of user identity and an authentication factor. [APPLICABILITY NOTES]: This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals). This requirement does not supersede multi-factor authentication (MFA) requirements but applies to those in-scope systems not otherwise subject to MFA requirements. A digital certificate is a valid option for “something you have” if it is unique for a particular user."
          },
          "8.3.2": {
            "title": "Strong cryptography is used to render all authentication factors unreadable during transmission and storage on all system components. [CUSTOMIZED APPROACH OBJECTIVE]: Cleartext authentication factors cannot be obtained, derived, or reused from the interception of communications or from stored data."
          },
          "8.3.3": {
            "title": "User identity is verified before modifying any authentication factor. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized individuals cannot gain system access by impersonating the identity of an authorized user."
          },
          "8.3.4": {
            "title": "Invalid authentication attempts are limited by: () Locking out the user ID after not more than 10 attempts. () Setting the lockout duration to a minimum of 30 minutes or until the user’s identity is confirmed. [CUSTOMIZED APPROACH OBJECTIVE]: An authentication factor cannot be guessed in a brute force, online attack. [APPLICABILITY NOTES]: This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals)."
          },
          "8.3.5": {
            "title": "If passwords/passphrases are used as authentication factors to meet Requirement 8.3.1, they are set and reset for each user as follows: () Set to a unique value for first-time use and upon reset. () Forced to be changed immediately after the first use. [CUSTOMIZED APPROACH OBJECTIVE]: An initial or reset password/passphrase assigned to a user cannot be used by an unauthorized user."
          },
          "8.3.6": {
            "title": "If passwords/passphrases are used as authentication factors to meet Requirement 8.3.1, they meet the following minimum level of complexity: () A minimum length of 12 characters (or IF the system does not support 12 characters, a minimum length of eight characters). () Contain both numeric and alphabetic characters. [CUSTOMIZED APPROACH OBJECTIVE]: A guessed password/passphrase cannot be verified by either an online or offline brute force attack. [APPLICABILITY NOTES]: This requirement is not intended to apply to: () User accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals). () Application or system accounts, which are governed by requirements in section 8.6. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment. Until 31 March 2025, passwords must be a minimum length of seven characters in accordance with PCI DSS v3.2.1 Requirement 8.2.3."
          },
          "8.3.7": {
            "title": "Individuals are not allowed to submit a new password/passphrase that is the same as any of the last four passwords/passphrases used. [CUSTOMIZED APPROACH OBJECTIVE]: A previously used password cannot be used to gain access to an account for at least 12 months. [APPLICABILITY NOTES]: This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals)."
          },
          "8.3.8": {
            "title": "Authentication policies and procedures are documented and communicated to all users including: () Guidance on selecting strong authentication factors. () Guidance for how users should protect their authentication factors. () Instructions not to reuse previously used passwords/passphrases. () Instructions to change passwords/passphrases if there is any suspicion or knowledge that the password/passphrases have been compromised and how to report the incident. [CUSTOMIZED APPROACH OBJECTIVE]: Users are knowledgeable about the correct use of authentication factors and can access assistance and guidance when required."
          },
          "8.3.9": {
            "title": "If passwords/passphrases are used as the only authentication factor for user access (i.e., in any single-factor authentication implementation) then either: () Passwords/passphrases are changed at least once every 90 days, OR () The security posture of accounts is dynamically analyzed, and real-time access to resources is automatically determined accordingly. [CUSTOMIZED APPROACH OBJECTIVE]: An undetected compromised password/passphrase cannot be used indefinitely. [APPLICABILITY NOTES]: This requirement applies to in-scope system components that are not in the CDE because these components are not subject to MFA requirements. This requirement is not intended to apply to user accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals). This requirement does not apply to service providers’ customer accounts but does apply to accounts for service provider personnel."
          },
          "8.3.10": {
            "title": "Additional requirement for service providers only: If passwords/passphrases are used as the only authentication factor for customer user access to cardholder data (i.e., in any singlefactor authentication implementation), then guidance is provided to customer users including: () Guidance for customers to change their user passwords/passphrases periodically. () Guidance as to when, and under what circumstances, passwords/passphrases are to be changed. [CUSTOMIZED APPROACH OBJECTIVE]: Passwords/passphrases for service providers’ customers cannot be used indefinitely. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement does not apply to accounts of consumer users accessing their own payment card information. This requirement for service providers will be superseded by Requirement 8.3.10.1 once 8.3.10.1 becomes effective."
          },
          "8.3.10.1": {
            "title": "Additional requirement for service providers only: If passwords/passphrases are used as the only authentication factor for customer user access (i.e., in any single-factor authentication implementation) then either: () Passwords/passphrases are changed at least once every 90 days, OR () The security posture of accounts is dynamically analyzed, and real-time access to resources is automatically determined accordingly. [CUSTOMIZED APPROACH OBJECTIVE]: Passwords/passphrases for service providers’ customers cannot be used indefinitely. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement does not apply to accounts of consumer users accessing their own payment card information. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment. Until this requirement is effective on 31 March 2025, service providers may meet either Requirement 8.3.10 or 8.3.10.1."
          },
          "8.3.11": {
            "title": "Where authentication factors such as physical or logical security tokens, smart cards, or certificates are used: () Factors are assigned to an individual user and not shared among multiple users. () Physical and/or logical controls ensure only the intended user can use that factor to gain access. [CUSTOMIZED APPROACH OBJECTIVE]: An authentication factor cannot be used by anyone other than the user to which it is assigned."
          }
        }
      },
      "8.4": {
        "title": "Multi-factor authentication (MFA) is implemented to secure access into the CDE.",
        "defined_approaches": {
          "8.4.1": {
            "title": "MFA is implemented for all non-console access into the CDE for personnel with administrative access. [CUSTOMIZED APPROACH OBJECTIVE]: Administrative access to the CDE cannot be obtained by the use of a single authentication factor. [APPLICABILITY NOTES]: The requirement for MFA for non-console administrative access applies to all personnel with elevated or increased privileges accessing the CDE via a non-console connection—that is, via logical access occurring over a network interface rather than via a direct, physical connection. MFA is considered a best practice for non-console administrative access to in-scope system components that are not part of the CDE."
          },
          "8.4.2": {
            "title": "MFA is implemented for all access into the CDE. [CUSTOMIZED APPROACH OBJECTIVE]: Access into the CDE cannot be obtained by the use of a single authentication factor. [APPLICABILITY NOTES]: This requirement does not apply to: () Application or system accounts performing automated functions. () User accounts on point-of-sale terminals that have access to only one card number at a time to facilitate a single transaction (such as IDs used by cashiers on point-of-sale terminals). MFA is required for both types of access specified in Requirements 8.4.2 and 8.4.3. Therefore, applying MFA to one type of access does not replace the need to apply another instance of MFA to the other type of access. If an individual first connects to the entity’s network via remote access, and then later initiates a connection into the CDE from within the network, per this requirement the individual would authenticate using MFA twice, once when connecting via remote access to the entity’s network and once when connecting via non-console administrative access from the entity’s network into the CDE. The MFA requirements apply for all types of system components, including cloud, hosted systems, and on-premises applications, network security devices, workstations, servers, and endpoints, and includes access directly to an entity’s networks or systems as well as web-based access to an application or function. MFA for remote access into the CDE can be implemented at the network or system/application level; it does not have to be applied at both levels. For example, if MFA is used when a user connects to the CDE network, it does not have to be used when the user logs into each system or application within the CDE. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "8.4.3": {
            "title": "MFA is implemented for all remote network access originating from outside the entity’s network that could access or impact the CDE as follows: () All remote access by all personnel, both users and administrators, originating from outside the entity’s network. () All remote access by third parties and vendors. [CUSTOMIZED APPROACH OBJECTIVE]: Remote access to the entity’s network cannot be obtained by using a single authentication factor. [APPLICABILITY NOTES]: The requirement for MFA for remote access originating from outside the entity’s network applies to all user accounts that can access the network remotely, where that remote access leads to or could lead to access into the CDE. If remote access is to a part of the entity’s network that is properly segmented from the CDE, such that remote users cannot access or impact the CDE, MFA for remote access to that part of the network is not required. However, MFA is required for any remote access to networks with access to the CDE and is recommended for all remote access to the entity’s networks. The MFA requirements apply for all types of system components, including cloud, hosted systems, and on-premises applications, network security devices, workstations, servers, and endpoints, and includes access directly to an entity’s networks or systems as well as web-based access to an application or function."
          }
        }
      },
      "8.5": {
        "title": "Multi-factor authentication (MFA) systems are configured to prevent misuse.",
        "defined_approaches": {
          "8.5.1": {
            "title": "MFA systems are implemented as follows: () The MFA system is not susceptible to replay attacks. () MFA systems cannot be bypassed by any users, including administrative users unless specifically documented, and authorized by management on an exception basis, for a limited time period. () At least two different types of authentication factors are used. () Success of all authentication factors is required before access is granted. [CUSTOMIZED APPROACH OBJECTIVE]: MFA systems are resistant to attack and strictly control any administrative overrides. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "8.6": {
        "title": "Use of application and system accounts and associated authentication factors is strictly managed.",
        "defined_approaches": {
          "8.6.1": {
            "title": "If accounts used by systems or applications can be used for interactive login, they are managed as follows: () Interactive use is prevented unless needed for an exceptional circumstance. () Interactive use is limited to the time needed for the exceptional circumstance. () Business justification for interactive use is documented. () Interactive use is explicitly approved by management. () Individual user identity is confirmed before access to account is granted. () Every action taken is attributable to an individual user. [CUSTOMIZED APPROACH OBJECTIVE]: When used interactively, all actions with accounts designated as system or application accounts are authorized and attributable to an individual person. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "8.6.2": {
            "title": "Passwords/passphrases for any application and system accounts that can be used for interactive login are not hard coded in scripts, configuration/property files, or bespoke and custom source code. [CUSTOMIZED APPROACH OBJECTIVE]: Passwords/passphrases used by application and system accounts cannot be used by unauthorized personnel. [APPLICABILITY NOTES]: Stored passwords/passphrases are required to be encrypted in accordance with PCI DSS Requirement 8.3.2. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "8.6.3": {
            "title": "Passwords/passphrases for any application and system accounts are protected against misuse as follows: () Passwords/passphrases are changed periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1) and upon suspicion or confirmation of compromise. () Passwords/passphrases are constructed with sufficient complexity appropriate for how frequently the entity changes the passwords/passphrases. [CUSTOMIZED APPROACH OBJECTIVE]: Passwords/passphrases used by application and system accounts cannot be used indefinitely and are structured to resist brute-force and guessing attacks. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      }
    }
  },
  "9": {
    "title": "Restrict Physical Access to Cardholder Data",
    "subreqs": {
      "9.1": {
        "title": "Processes and mechanisms for restricting physical access to cardholder data are defined and understood.",
        "defined_approaches": {
          "9.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 9 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 9 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "9.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 9 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 9 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "9.2": {
        "title": "Physical access controls manage entry into facilities and systems containing cardholder data.",
        "defined_approaches": {
          "9.2.1": {
            "title": "Appropriate facility entry controls are in place to restrict physical access to systems in the CDE. [CUSTOMIZED APPROACH OBJECTIVE]: System components in the CDE cannot be physically accessed by unauthorized personnel."
          },
          "9.2.1.1": {
            "title": "Individual physical access to sensitive areas within the CDE is monitored with either video cameras or physical access control mechanisms (or both) as follows: () Entry and exit points to/from sensitive areas within the CDE are monitored. () Monitoring devices or mechanisms are protected from tampering or disabling. () Collected data is reviewed and correlated with other entries. () Collected data is stored for at least three months, unless otherwise restricted by law. [CUSTOMIZED APPROACH OBJECTIVE]: Trusted, verifiable records are maintained of individual physical entry to, and exit from, sensitive areas."
          },
          "9.2.2": {
            "title": "Physical and/or logical controls are implemented to restrict use of publicly accessible network jacks within the facility. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized devices cannot connect to the entity’s network from public areas within the facility."
          },
          "9.2.3": {
            "title": "Physical access to wireless access points, gateways, networking/communications hardware, and telecommunication lines within the facility is restricted. [CUSTOMIZED APPROACH OBJECTIVE]: Physical networking equipment cannot be accessed by unauthorized personnel."
          },
          "9.2.4": {
            "title": "Access to consoles in sensitive areas is restricted via locking when not in use. [CUSTOMIZED APPROACH OBJECTIVE]: Physical consoles within sensitive areas cannot be used by unauthorized personnel."
          }
        }
      },
      "9.3": {
        "title": "Physical access for personnel and visitors is authorized and managed.",
        "defined_approaches": {
          "9.3.1": {
            "title": "Procedures are implemented for authorizing and managing physical access of personnel to the CDE, including: () Identifying personnel. () Managing changes to an individual’s physical access requirements. () Revoking or terminating personnel identification. () Limiting access to the identification process or system to authorized personnel. [CUSTOMIZED APPROACH OBJECTIVE]: Requirements for access to the physical CDE are defined and enforced to identify and authorize personnel."
          },
          "9.3.1.1": {
            "title": "Physical access to sensitive areas within the CDE for personnel is controlled as follows: () Access is authorized and based on individual job function. () Access is revoked immediately upon termination. () All physical access mechanisms, such as keys, access cards, etc., are returned or disabled upon termination. [CUSTOMIZED APPROACH OBJECTIVE]: Sensitive areas cannot be accessed by unauthorized personnel."
          },
          "9.3.2": {
            "title": "Procedures are implemented for authorizing and managing visitor access to the CDE, including: () Visitors are authorized before entering. () Visitors are escorted at all times. () Visitors are clearly identified and given a badge or other identification that expires. () Visitor badges or other identification visibly distinguishes visitors from personnel. [CUSTOMIZED APPROACH OBJECTIVE]: Requirements for visitor access to the CDE are defined and enforced. Visitors cannot exceed any authorized physical access allowed while in the CDE."
          },
          "9.3.3": {
            "title": "Visitor badges or identification are surrendered or deactivated before visitors leave the facility or at the date of expiration. [CUSTOMIZED APPROACH OBJECTIVE]: Visitor identification or badges cannot be reused after expiration."
          },
          "9.3.4": {
            "title": "A visitor log is used to maintain a physical record of visitor activity within the facility and within sensitive areas, including: () The visitor’s name and the organization represented. () The date and time of the visit. () The name of the personnel authorizing physical access. () Retaining the log for at least three months, unless otherwise restricted by law. [CUSTOMIZED APPROACH OBJECTIVE]: Records of visitor access that enable the identification of individuals are maintained."
          }
        }
      },
      "9.4": {
        "title": "Media with cardholder data is securely stored, accessed, distributed, and destroyed.",
        "defined_approaches": {
          "9.4.1": {
            "title": "All media with cardholder data is physically secured. [CUSTOMIZED APPROACH OBJECTIVE]: Media with cardholder data cannot be accessed by unauthorized personnel."
          },
          "9.4.1.1": {
            "title": "Offline media backups with cardholder data are stored in a secure location. [CUSTOMIZED APPROACH OBJECTIVE]: Offline backups cannot be accessed by unauthorized personnel."
          },
          "9.4.1.2": {
            "title": "The security of the offline media backup location(s) with cardholder data is reviewed at least once every 12 months. [CUSTOMIZED APPROACH OBJECTIVE]: The security controls protecting offline backups are verified periodically by inspection."
          },
          "9.4.2": {
            "title": "All media with cardholder data is classified in accordance with the sensitivity of the data. [CUSTOMIZED APPROACH OBJECTIVE]: Media are classified and protected appropriately."
          },
          "9.4.3": {
            "title": "Media with cardholder data sent outside the facility is secured as follows: () Media sent outside the facility is logged. () Media is sent by secured courier or other delivery method that can be accurately tracked. () Offsite tracking logs include details about media location. [CUSTOMIZED APPROACH OBJECTIVE]: Media is secured and tracked when transported outside the facility."
          },
          "9.4.4": {
            "title": "Management approves all media with cardholder data that is moved outside the facility (including when media is distributed to individuals). [CUSTOMIZED APPROACH OBJECTIVE]: Media cannot leave a facility without the approval of accountable personnel. [APPLICABILITY NOTES]: Individuals approving media movements should have the appropriate level of management authority to grant this approval. However, it is not specifically required that such individuals have “manager” as part of their title."
          },
          "9.4.5": {
            "title": "Inventory logs of all electronic media with cardholder data are maintained. [CUSTOMIZED APPROACH OBJECTIVE]: Accurate inventories of stored electronic media are maintained."
          },
          "9.4.5.1": {
            "title": "Inventories of electronic media with cardholder data are conducted at least once every 12 months. [CUSTOMIZED APPROACH OBJECTIVE]: Media inventories are verified periodically."
          },
          "9.4.6": {
            "title": "Hard-copy materials with cardholder data are destroyed when no longer needed for business or legal reasons, as follows: () Materials are cross-cut shredded, incinerated, or pulped so that cardholder data cannot be reconstructed. () Materials are stored in secure storage containers prior to destruction. [CUSTOMIZED APPROACH OBJECTIVE]: Cardholder data cannot be recovered from media that has been destroyed or which is pending destruction. [APPLICABILITY NOTES]: These requirements for media destruction when that media is no longer needed for business or legal reasons are separate and distinct from PCI DSS Requirement 3.2.1, which is for securely deleting cardholder data when no longer needed per the entity’s cardholder data retention policies."
          },
          "9.4.7": {
            "title": "Electronic media with cardholder data is destroyed when no longer needed for business or legal reasons via one of the following: () The electronic media is destroyed. () The cardholder data is rendered unrecoverable so that it cannot be reconstructed. [CUSTOMIZED APPROACH OBJECTIVE]: Cardholder data cannot be recovered from media that has been erased or destroyed. [APPLICABILITY NOTES]: These requirements for media destruction when that media is no longer needed for business or legal reasons are separate and distinct from PCI DSS Requirement 3.2.1, which is for securely deleting cardholder data when no longer needed per the entity’s cardholder data retention policies."
          }
        }
      },
      "9.5": {
        "title": "Point-of-interaction (POI) devices are protected from tampering and unauthorized substitution.",
        "defined_approaches": {
          "9.5.1": {
            "title": "POI devices that capture payment card data via direct physical interaction with the payment card form factor are protected from tampering and unauthorized substitution, including the following: () Maintaining a list of POI devices. () Periodically inspecting POI devices to look for tampering or unauthorized substitution. () Training personnel to be aware of suspicious behavior and to report tampering or unauthorized substitution of devices. [CUSTOMIZED APPROACH OBJECTIVE]: The entity has defined procedures to protect and manage point of interaction devices. Expectations, controls, and oversight for the management and protection of POI devices are defined and adhered to by affected personnel. [APPLICABILITY NOTES]: These requirements apply to deployed POI devices used in card-present transactions (that is, a payment card form factor such as a card that is swiped, tapped, or dipped). This requirement is not intended to apply to manual PAN key-entry components such as computer keyboards. This requirement is recommended, but not required, for manual PAN key-entry components such as computer keyboards. This requirement does not apply to commercial offthe-shelf (COTS) devices (for example, smartphones or tablets), which are mobile merchant-owned devices designed for mass-market distribution."
          },
          "9.5.1.1": {
            "title": "An up-to-date list of POI devices is maintained, including: () Make and model of the device. () Location of device. () Device serial number or other methods of unique identification. [CUSTOMIZED APPROACH OBJECTIVE]: The identity and location of POI devices is recorded and known at all times."
          },
          "9.5.1.2": {
            "title": "POI device surfaces are periodically inspected to detect tampering and unauthorized substitution. [CUSTOMIZED APPROACH OBJECTIVE]: Point of Interaction Devices cannot be tampered with, substituted without authorization, or have skimming attachments installed without timely detection."
          },
          "9.5.1.2.1": {
            "title": "The frequency of periodic POI device inspections and the type of inspections performed is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1. [CUSTOMIZED APPROACH OBJECTIVE]: POI devices are inspected at a frequency that addresses the entity’s risk. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "9.5.1.3": {
            "title": "Training is provided for personnel in POI environments to be aware of attempted tampering or replacement of POI devices, and includes: () Verifying the identity of any third-party persons claiming to be repair or maintenance personnel, before granting them access to modify or troubleshoot devices. () Procedures to ensure devices are not installed, replaced, or returned without verification. () Being aware of suspicious behavior around devices. () Reporting suspicious behavior and indications of device tampering or substitution to appropriate personnel. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel are knowledgeable about the types of attacks against POI devices, the entity’s technical and procedural countermeasures, and can access assistance and guidance when required."
          }
        }
      }
    }
  },
  "10": {
    "title": "Log and Monitor All Access to System Components and Cardholder Data",
    "subreqs": {
      "10.1": {
        "title": "Processes and mechanisms for logging and monitoring all access to system components and cardholder data are defined and documented.",
        "defined_approaches": {
          "10.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 10 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 10 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "10.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 10 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 10 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "10.2": {
        "title": "Audit logs are implemented to support the detection of anomalies and suspicious activity, and the forensic analysis of events.",
        "defined_approaches": {
          "10.2.1": {
            "title": "Audit logs are enabled and active for all system components and cardholder data. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all activities affecting system components and cardholder data are captured."
          },
          "10.2.1.1": {
            "title": "Audit logs capture all individual user access to cardholder data. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all individual user access to cardholder data are captured."
          },
          "10.2.1.2": {
            "title": "Audit logs capture all actions taken by any individual with administrative access, including any interactive use of application or system accounts. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all actions performed by individuals with elevated privileges are captured."
          },
          "10.2.1.3": {
            "title": "Audit logs capture all access to audit logs. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all access to audit logs are captured."
          },
          "10.2.1.4": {
            "title": "Audit logs capture all invalid logical access attempts. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all invalid access attempts are captured."
          },
          "10.2.1.5": {
            "title": "Audit logs capture all changes to identification and authentication credentials including, but not limited to: () Creation of new accounts. () Elevation of privileges. () All changes, additions, or deletions to accounts with administrative access. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all changes to identification and authentication credentials are captured."
          },
          "10.2.1.6": {
            "title": "Audit logs capture the following: () All initialization of new audit logs, and () All starting, stopping, or pausing of the existing audit logs. [CUSTOMIZED APPROACH OBJECTIVE]: Records of all changes to audit log activity status are captured."
          },
          "10.2.1.7": {
            "title": "Audit logs capture all creation and deletion of system-level objects. [CUSTOMIZED APPROACH OBJECTIVE]: Records of alterations that indicate a system has been modified from its intended functionality are captured."
          },
          "10.2.2": {
            "title": "Audit logs record the following details for each auditable event: () User identification. () Type of event. () Date and time. () Success and failure indication. () Origination of event. () Identity or name of affected data, system component, resource, or service (for example, name and protocol). [CUSTOMIZED APPROACH OBJECTIVE]: Sufficient data to be able to identify successful and failed attempts and who, what, when, where, and how for each event listed in requirement 10.2.1 are captured."
          }
        }
      },
      "10.3": {
        "title": "Audit logs are protected from destruction and unauthorized modifications.",
        "defined_approaches": {
          "10.3.1": {
            "title": "Read access to audit logs files is limited to those with a job-related need. [CUSTOMIZED APPROACH OBJECTIVE]: Stored activity records cannot be accessed by unauthorized personnel."
          },
          "10.3.2": {
            "title": "Audit log files are protected to prevent modifications by individuals. [CUSTOMIZED APPROACH OBJECTIVE]: Stored activity records cannot be modified by personnel."
          },
          "10.3.3": {
            "title": "Audit log files, including those for externalfacing technologies, are promptly backed up to a secure, central, internal log server(s) or other media that is difficult to modify. [CUSTOMIZED APPROACH OBJECTIVE]: Stored activity records are secured and preserved in a central location to prevent unauthorized modification."
          },
          "10.3.4": {
            "title": "File integrity monitoring or change-detection mechanisms is used on audit logs to ensure that existing log data cannot be changed without generating alerts. [CUSTOMIZED APPROACH OBJECTIVE]: Stored activity records cannot be modified without an alert being generated."
          }
        }
      },
      "10.4": {
        "title": "Audit logs are reviewed to identify anomalies or suspicious activity.",
        "defined_approaches": {
          "10.4.1": {
            "title": "The following audit logs are reviewed at least once daily: () All security events. () Logs of all system components that store, process, or transmit CHD and/or SAD. () Logs of all critical system components. () Logs of all servers and system components that perform security functions (for example, network security controls, intrusion-detection systems/intrusion-prevention systems (IDS/IPS), authentication servers). [CUSTOMIZED APPROACH OBJECTIVE]: Potentially suspicious or anomalous activities are quickly identified to minimize impact."
          },
          "10.4.1.1": {
            "title": "Automated mechanisms are used to perform audit log reviews. [CUSTOMIZED APPROACH OBJECTIVE]: Potentially suspicious or anomalous activities are identified via a repeatable and consistent mechanism. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "10.4.2": {
            "title": "Logs of all other system components (those not specified in Requirement 10.4.1) are reviewed periodically. [CUSTOMIZED APPROACH OBJECTIVE]: Potentially suspicious or anomalous activities for other system components (not included in 10.4.1) are reviewed in accordance with the entity’s identified risk. [APPLICABILITY NOTES]: This requirement is applicable to all other in-scope system components not included in Requirement 10.4.1."
          },
          "10.4.2.1": {
            "title": "The frequency of periodic log reviews for all other system components (not defined in Requirement 10.4.1) is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1 [CUSTOMIZED APPROACH OBJECTIVE]: Log reviews for lower-risk system components are performed at a frequency that addresses the entity’s risk. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "10.4.3": {
            "title": "Exceptions and anomalies identified during the review process are addressed. [CUSTOMIZED APPROACH OBJECTIVE]: Suspicious or anomalous activities are addressed."
          }
        }
      },
      "10.5": {
        "title": "Audit log history is retained and available for analysis.",
        "defined_approaches": {
          "10.5.1": {
            "title": "Retain audit log history for at least 12 months, with at least the most recent three months immediately available for analysis. [CUSTOMIZED APPROACH OBJECTIVE]: Historical records of activity are available immediately to support incident response and are retained for at least 12 months."
          }
        }
      },
      "10.6": {
        "title": "Time-synchronization mechanisms support consistent time settings across all systems.",
        "defined_approaches": {
          "10.6.1": {
            "title": "System clocks and time are synchronized using time-synchronization technology. [CUSTOMIZED APPROACH OBJECTIVE]: Common time is established across all systems. [APPLICABILITY NOTES]: Keeping time-synchronization technology current includes managing vulnerabilities and patching the technology according to PCI DSS Requirements 6.3.1 and 6.3.3."
          },
          "10.6.2": {
            "title": "Systems are configured to the correct and consistent time as follows: () One or more designated time servers are in use. () Only the designated central time server(s) receives time from external sources. () Time received from external sources is based on International Atomic Time or Coordinated Universal Time (UTC). () The designated time server(s) accept time updates only from specific industry-accepted external sources. () Where there is more than one designated time server, the time servers peer with one another to keep accurate time. () Internal systems receive time information only from designated central time server(s). [CUSTOMIZED APPROACH OBJECTIVE]: The time on all systems is accurate and consistent."
          },
          "10.6.3": {
            "title": "Time synchronization settings and data are protected as follows: () Access to time data is restricted to only personnel with a business need. () Any changes to time settings on critical systems are logged, monitored, and reviewed. [CUSTOMIZED APPROACH OBJECTIVE]: System time settings cannot be modified by unauthorized personnel."
          }
        }
      },
      "10.7": {
        "title": "Failures of critical security control systems are detected, reported, and responded to promptly.",
        "defined_approaches": {
          "10.7.1": {
            "title": "Additional requirement for service providers only: Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of the following critical security control systems: () Network security controls. () IDS/IPS. () FIM. () Anti-malware solutions. () Physical access controls. () Logical access controls. () Audit logging mechanisms. () Segmentation controls (if used). [CUSTOMIZED APPROACH OBJECTIVE]: Failures in critical security control systems are promptly identified and addressed. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement will be superseded by Requirement 10.7.2 as of 31 March 2025."
          },
          "10.7.2": {
            "title": "Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of the following critical security control systems: () Network security controls. () IDS/IPS. () Change-detection mechanisms. () Anti-malware solutions. () Physical access controls. () Logical access controls. () Audit logging mechanisms. () Segmentation controls (if used). () Audit log review mechanisms. () Automated security testing tools (if used). [CUSTOMIZED APPROACH OBJECTIVE]: Failures in critical security control systems are promptly identified and addressed. [APPLICABILITY NOTES]: This requirement applies to all entities, including service providers, and will supersede Requirement 10.7.1 as of 31 March 2025. It includes two additional critical security control systems not in Requirement 10.7.1. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "10.7.3": {
            "title": "Failures of any critical security controls systems are responded to promptly, including but not limited to: () Restoring security functions. () Identifying and documenting the duration (date and time from start to end) of the security failure. () Identifying and documenting the cause(s) of failure and documenting required remediation. () Identifying and addressing any security issues that arose during the failure. () Determining whether further actions are required as a result of the security failure. () Implementing controls to prevent the cause of failure from reoccurring. () Resuming monitoring of security controls. [CUSTOMIZED APPROACH OBJECTIVE]: Failures of critical security control systems are analyzed, contained, and resolved, and security controls restored to minimize impact. Resulting security issues are addressed, and measures taken to prevent reoccurrence. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider until 31 March 2025, after which this requirement will apply to all entities. This is a current v3.2.1 requirement that applies to service providers only. However, this requirement is a best practice for all other entities until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      }
    }
  },
  "11": {
    "title": "Test Security of Systems and Networks Regularly",
    "subreqs": {
      "11.1": {
        "title": "Processes and mechanisms for regularly testing security of systems and networks are defined and understood.",
        "defined_approaches": {
          "11.1.1": {
            "title": "All security policies and operational procedures that are identified in Requirement 11 are: () Documented. () Kept up to date. () In use. () Known to all affected parties. [CUSTOMIZED APPROACH OBJECTIVE]: Expectations, controls, and oversight for meeting activities within Requirement 11 are defined and adhered to by affected personnel. All supporting activities are repeatable, consistently applied, and conform to management’s intent."
          },
          "11.1.2": {
            "title": "Roles and responsibilities for performing activities in Requirement 11 are documented, assigned, and understood. [CUSTOMIZED APPROACH OBJECTIVE]: Day-to-day responsibilities for performing all the activities in Requirement 11 are allocated. Personnel are accountable for successful, continuous operation of these requirements."
          }
        }
      },
      "11.2": {
        "title": "Wireless access points are identified and monitored, and unauthorized wireless access points are addressed.",
        "defined_approaches": {
          "11.2.1": {
            "title": "Authorized and unauthorized wireless access points are managed as follows: () The presence of wireless (Wi-Fi) access points is tested for, () All authorized and unauthorized wireless access points are detected and identified, () Testing, detection, and identification occurs at least once every three months. () If automated monitoring is used, personnel are notified via generated alerts. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized wireless access points are identified and addressed periodically. [APPLICABILITY NOTES]: The requirement applies even when a policy exists that prohibits the use of wireless technology since attackers do not read and follow company policy. Methods used to meet this requirement must be sufficient to detect and identify both authorized and unauthorized devices, including unauthorized devices attached to devices that themselves are authorized."
          },
          "11.2.2": {
            "title": "An inventory of authorized wireless access points is maintained, including a documented business justification. [CUSTOMIZED APPROACH OBJECTIVE]: Unauthorized wireless access points are not mistaken for authorized wireless access points."
          }
        }
      },
      "11.3": {
        "title": "External and internal vulnerabilities are regularly identified, prioritized, and addressed.",
        "defined_approaches": {
          "11.3.1": {
            "title": "Internal vulnerability scans are performed as follows: () At least once every three months. () High-risk and critical vulnerabilities (per the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are resolved. () Rescans are performed that confirm all highrisk and critical vulnerabilities (as noted above) have been resolved. () Scan tool is kept up to date with latest vulnerability information. () Scans are performed by qualified personnel and organizational independence of the tester exists. [CUSTOMIZED APPROACH OBJECTIVE]: The security posture of all system components is verified periodically using automated tools designed to detect vulnerabilities operating inside the network. Detected vulnerabilities are assessed and rectified based on a formal risk assessment framework. [APPLICABILITY NOTES]: It is not required to use a QSA or ASV to conduct internal vulnerability scans. Internal vulnerability scans can be performed by qualified, internal staff that are reasonably independent of the system component(s) being scanned (for example, a network administrator should not be responsible for scanning the network), or an entity may choose to have internal vulnerability scans performed by a firm specializing in vulnerability scanning."
          },
          "11.3.1.1": {
            "title": "All other applicable vulnerabilities (those not ranked as high-risk or critical per the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are managed as follows: () Addressed based on the risk defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1. () Rescans are conducted as needed. [CUSTOMIZED APPROACH OBJECTIVE]: Lower ranked vulnerabilities (lower than high or critical) are addressed at a frequency in accordance with the entity’s risk. [APPLICABILITY NOTES]: The timeframe for addressing lower-risk vulnerabilities is subject to the results of a risk analysis per Requirement 12.3.1 that includes (minimally) identification of assets being protected, threats, and likelihood and/or impact of a threat being realized. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "11.3.1.2": {
            "title": "Internal vulnerability scans are performed via authenticated scanning as follows: () Systems that are unable to accept credentials for authenticated scanning are documented. () Sufficient privileges are used for those systems that accept credentials for scanning. () If accounts used for authenticated scanning can be used for interactive login, they are managed in accordance with Requirement 8.2.2. [CUSTOMIZED APPROACH OBJECTIVE]: Automated tools used to detect vulnerabilities can detect vulnerabilities local to each system, which are not visible remotely. [APPLICABILITY NOTES]: The authenticated scanning tools can be either host-based or network-based. “Sufficient” privileges are those needed to access system resources such that a thorough scan can be conducted that detects known vulnerabilities. This requirement does not apply to system components that cannot accept credentials for scanning. Examples of systems that may not accept credentials for scanning include some network and security appliances, mainframes, and containers. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "11.3.1.3": {
            "title": "Internal vulnerability scans are performed after any significant change as follows: () High-risk and critical vulnerabilities (per the entity’s vulnerability risk rankings defined at Requirement 6.3.1) are resolved. () Rescans are conducted as needed. () Scans are performed by qualified personnel and organizational independence of the tester exists (not required to be a QSA or ASV). [CUSTOMIZED APPROACH OBJECTIVE]: The security posture of all system components is verified following significant changes to the network or systems, by using automated tools designed to detect vulnerabilities operating inside the network. Detected vulnerabilities are assessed and rectified based on a formal risk assessment framework. [APPLICABILITY NOTES]: Authenticated internal vulnerability scanning per Requirement 11.3.1.2 is not required for scans performed after significant changes."
          },
          "11.3.2": {
            "title": "External vulnerability scans are performed as follows: () At least once every three months. () By a PCI SSC Approved Scanning Vendor (ASV). () Vulnerabilities are resolved and ASV Program Guide requirements for a passing scan are met. () Rescans are performed as needed to confirm that vulnerabilities are resolved per the ASV Program Guide requirements for a passing scan. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is not eligible for the customized approach. [APPLICABILITY NOTES]: For initial PCI DSS compliance, it is not required that four passing scans be completed within 12 months if the assessor verifies: 1) the most recent scan result was a passing scan, 2) the entity has documented policies and procedures requiring scanning at least once every three months, and 3) vulnerabilities noted in the scan results have been corrected as shown in a re-scan(s). However, for subsequent years after the initial PCI DSS assessment, passing scans at least every three months must have occurred. ASV scanning tools can scan a vast array of network types and topologies. Any specifics about the target environment (for example, load balancers, third-party providers, ISPs, specific configurations, protocols in use, scan interference) should be worked out between the ASV and scan customer. Refer to the ASV Program Guide published on the PCI SSC website for scan customer responsibilities, scan preparation, etc."
          },
          "11.3.2.1": {
            "title": "External vulnerability scans are performed after any significant change as follows: () Vulnerabilities that are scored 4.0 or higher by the CVSS are resolved. () Rescans are conducted as needed. () Scans are performed by qualified personnel and organizational independence of the tester exists (not required to be a QSA or ASV). [CUSTOMIZED APPROACH OBJECTIVE]: The security posture of all system components is verified following significant changes to the network or systems, by using tools designed to detect vulnerabilities operating from outside the network. Detected vulnerabilities are assessed and rectified based on a formal risk assessment framework."
          }
        }
      },
      "11.4": {
        "title": "External and internal penetration testing is regularly performed, and exploitable vulnerabilities and security weaknesses are corrected.",
        "defined_approaches": {
          "11.4.1": {
            "title": "A penetration testing methodology is defined, documented, and implemented by the entity, and includes: () Industry-accepted penetration testing approaches. () Coverage for the entire CDE perimeter and critical systems. () Testing from both inside and outside the network. () Testing to validate any segmentation and scopereduction controls. () Application-layer penetration testing to identify, at a minimum, the vulnerabilities listed in Requirement 6.2.4. () Network-layer penetration tests that encompass all components that support network functions as well as operating systems. () Review and consideration of threats and vulnerabilities experienced in the last 12 months. () Documented approach to assessing and addressing the risk posed by exploitable vulnerabilities and security weaknesses found during penetration testing. () Retention of penetration testing results and remediation activities results for at least 12 months. [CUSTOMIZED APPROACH OBJECTIVE]: A formal methodology is defined for thorough technical testing that attempts to exploit vulnerabilities and security weaknesses via simulated attack methods by a competent manual attacker. [APPLICABILITY NOTES]: Testing from inside the network (or “internal penetration testing”) means testing from both inside the CDE and into the CDE from trusted and untrusted internal networks. Testing from outside the network (or “external penetration testing”) means testing the exposed external perimeter of trusted networks, and critical systems connected to or accessible to public network infrastructures."
          },
          "11.4.2": {
            "title": "Internal penetration testing is performed: () Per the entity’s defined methodology, () At least once every 12 months () After any significant infrastructure or application upgrade or change () By a qualified internal resource or qualified external third-party () Organizational independence of the tester exists (not required to be a QSA or ASV). [CUSTOMIZED APPROACH OBJECTIVE]: Internal system defenses are verified by technical testing according to the entity’s defined methodology as frequently as needed to address evolving and new attacks and threats and ensure that significant changes do not introduce unknown vulnerabilities."
          },
          "11.4.3": {
            "title": "External penetration testing is performed: () Per the entity’s defined methodology () At least once every 12 months () After any significant infrastructure or application upgrade or change () By a qualified internal resource or qualified external third party () Organizational independence of the tester exists (not required to be a QSA or ASV). [CUSTOMIZED APPROACH OBJECTIVE]: External system defenses are verified by technical testing according to the entity’s defined methodology as frequently as needed to address evolving and new attacks and threats, and to ensure that significant changes do not introduce unknown vulnerabilities."
          },
          "11.4.4": {
            "title": "Exploitable vulnerabilities and security weaknesses found during penetration testing are corrected as follows: () In accordance with the entity’s assessment of the risk posed by the security issue as defined in Requirement 6.3.1. () Penetration testing is repeated to verify the corrections. [CUSTOMIZED APPROACH OBJECTIVE]: Vulnerabilities and security weaknesses found while verifying system defenses are mitigated."
          },
          "11.4.5": {
            "title": "If segmentation is used to isolate the CDE from other networks, penetration tests are performed on segmentation controls as follows: () At least once every 12 months and after any changes to segmentation controls/methods () Covering all segmentation controls/methods in use. () According to the entity’s defined penetration testing methodology. () Confirming that the segmentation controls/methods are operational and effective, and isolate the CDE from all out-of-scope systems. () Confirming effectiveness of any use of isolation to separate systems with differing security levels (see Requirement 2.2.3). () Performed by a qualified internal resource or qualified external third party. () Organizational independence of the tester exists (not required to be a QSA or ASV). [CUSTOMIZED APPROACH OBJECTIVE]: If segmentation is used, it is verified periodically by technical testing to be continually effective, including after any changes, in isolating the CDE from all outof-scope systems."
          },
          "11.4.6": {
            "title": "Additional requirement for service providers only: If segmentation is used to isolate the CDE from other networks, penetration tests are performed on segmentation controls as follows: () At least once every six months and after any changes to segmentation controls/methods. () Covering all segmentation controls/methods in use. () According to the entity’s defined penetration testing methodology. () Confirming that the segmentation controls/methods are operational and effective, and isolate the CDE from all out-of-scope systems. () Confirming effectiveness of any use of isolation to separate systems with differing security levels (see Requirement 2.2.3). () Performed by a qualified internal resource or qualified external third party. () Organizational independence of the tester exists (not required to be a QSA or ASV). [CUSTOMIZED APPROACH OBJECTIVE]: If segmentation is used, it is verified by technical testing to be continually effective, including after any changes, in isolating the CDE from out-of-scope systems. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider."
          },
          "11.4.7": {
            "title": "Additional requirement for multi-tenant service providers only: Multi-tenant service providers support their customers for external penetration testing per Requirement 11.4.3 and 11.4.4. [CUSTOMIZED APPROACH OBJECTIVE]: Multi-tenant service providers support their customers’ need for technical testing either by providing access or evidence that comparable technical testing has been undertaken. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a multi-tenant service provider. To meet this requirement, a multi-tenant service provider may either: () Provide evidence to its customers to show that penetration testing has been performed according to Requirements 11.4.3 and 11.4.4 on the customers’ subscribed infrastructure, or () Provide prompt access to each of its customers, so customers can perform their own penetration testing. Evidence provided to customers can include redacted penetration testing results but needs to include sufficient information to prove that all elements of Requirements 11.4.3 and 11.4.4 have been met on the customer’s behalf. Refer also to Appendix A1: Additional PCI DSS Requirements for Multi-Tenant Service Providers. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "11.5": {
        "title": "Network intrusions and unexpected file changes are detected and responded to.",
        "defined_approaches": {
          "11.5.1": {
            "title": "Intrusion-detection and/or intrusionprevention techniques are used to detect and/or prevent intrusions into the network as follows: () All traffic is monitored at the perimeter of the CDE. () All traffic is monitored at critical points in the CDE. () Personnel are alerted to suspected compromises. () All intrusion-detection and prevention engines, baselines, and signatures are kept up to date. [CUSTOMIZED APPROACH OBJECTIVE]: Mechanisms to detect real-time suspicious or anomalous network traffic that may be indicative of threat actor activity are implemented. Alerts generated by these mechanisms are responded to by personnel, or by automated means that ensure that system components cannot be compromised as a result of the detected activity."
          },
          "11.5.1.1": {
            "title": "Additional requirement for service providers only: Intrusion-detection and/or intrusion-prevention techniques detect, alert on/prevent, and address covert malware communication channels. [CUSTOMIZED APPROACH OBJECTIVE]: Mechanisms are in place to detect and alert/prevent covert communications with command-and-control systems. Alerts generated by these mechanisms are responded to by personnel, or by automated means that ensure that such communications are blocked. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "11.5.2": {
            "title": "A change-detection mechanism (for example, file integrity monitoring tools) is deployed as follows: () To alert personnel to unauthorized modification (including changes, additions, and deletions) of critical files. () To perform critical file comparisons at least once weekly. [CUSTOMIZED APPROACH OBJECTIVE]: Critical files cannot be modified by unauthorized personnel without an alert being generated. [APPLICABILITY NOTES]: For change-detection purposes, critical files are usually those that do not regularly change, but the modification of which could indicate a system compromise or risk of compromise. Changedetection mechanisms such as file integrity monitoring products usually come pre-configured with critical files for the related operating system. Other critical files, such as those for custom applications, must be evaluated and defined by the entity (that is, the merchant or service provider)."
          }
        }
      },
      "11.6": {
        "title": "Unauthorized changes on payment pages are detected and responded to.",
        "defined_approaches": {
          "11.6.1": {
            "title": "A change- and tamper-detection mechanism is deployed as follows: () To alert personnel to unauthorized modification (including indicators of compromise, changes, additions, and deletions) to the HTTP headers and the contents of payment pages as received by the consumer browser. () The mechanism is configured to evaluate the received HTTP header and payment page. () The mechanism functions are performed as follows: – At least once every seven days OR – Periodically (at the frequency defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1). [CUSTOMIZED APPROACH OBJECTIVE]: E-commerce skimming code or techniques cannot be added to payment pages as received by the consumer browser without a timely alert being generated. Anti-skimming measures cannot be removed from payment pages without a prompt alert being generated. [APPLICABILITY NOTES]: The intention of this requirement is not that an entity installs software in the systems or browsers of its consumers, but rather that the entity uses techniques such as those described under Examples in the Guidance column to prevent and detect unexpected script activities. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      }
    }
  },
  "12": {
    "title": "Support Information Security with Organizational Policies and Programs",
    "subreqs": {
      "12.1": {
        "title": "A comprehensive information security policy that governs and provides direction for protection of the entity’s information assets is known and current. 12.10 Suspected and confirmed security incidents that could impact the CDE are responded to immediately.",
        "defined_approaches": {
          "12.1.1": {
            "title": "An overall information security policy is: () Established. () Published. () Maintained. () Disseminated to all relevant personnel, as well as to relevant vendors and business partners. [CUSTOMIZED APPROACH OBJECTIVE]: The strategic objectives and principles of information security are defined, adopted, and known to all personnel."
          },
          "12.1.2": {
            "title": "The information security policy is: () Reviewed at least once every 12 months. () Updated as needed to reflect changes to business objectives or risks to the environment. [CUSTOMIZED APPROACH OBJECTIVE]: The information security policy continues to reflect the organization’s strategic objectives and principles."
          },
          "12.1.3": {
            "title": "The security policy clearly defines information security roles and responsibilities for all personnel, and all personnel are aware of and acknowledge their information security responsibilities. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel understand their role in protecting the entity’s cardholder data."
          },
          "12.1.4": {
            "title": "Responsibility for information security is formally assigned to a Chief Information Security Officer or other information security knowledgeable member of executive management. [CUSTOMIZED APPROACH OBJECTIVE]: A designated member of executive management is responsible for information security."
          }
        }
      },
      "12.2": {
        "title": "Acceptable use policies for end-user technologies are defined and implemented.",
        "defined_approaches": {
          "12.2.1": {
            "title": "Acceptable use policies for end-user technologies are documented and implemented, including: () Explicit approval by authorized parties. () Acceptable uses of the technology. () List of products approved by the company for employee use, including hardware and software. [CUSTOMIZED APPROACH OBJECTIVE]: The use of end-user technologies is defined and managed to ensure authorized usage. [APPLICABILITY NOTES]: Examples of end-user technologies for which acceptable use policies are expected include, but are not limited to, remote access and wireless technologies, laptops, tablets, mobile phones, and removable electronic media, email usage, and Internet usage."
          }
        }
      },
      "12.3": {
        "title": "Risks to the cardholder data environment are formally identified, evaluated, and managed.",
        "defined_approaches": {
          "12.3.1": {
            "title": "Each PCI DSS requirement that provides flexibility for how frequently it is performed (for example, requirements to be performed periodically) is supported by a targeted risk analysis that is documented and includes: () Identification of the assets being protected. () Identification of the threat(s) that the requirement is protecting against. () Identification of factors that contribute to the likelihood and/or impact of a threat being realized. () Resulting analysis that determines, and includes justification for, how frequently the requirement must be performed to minimize the likelihood of the threat being realized. () Review of each targeted risk analysis at least once every 12 months to determine whether the results are still valid or if an updated risk analysis is needed. () Performance of updated risk analyses when needed, as determined by the annual review. [CUSTOMIZED APPROACH OBJECTIVE]: Up to date knowledge and assessment of risks to the CDE are maintained. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "12.3.2": {
            "title": "A targeted risk analysis is performed for each PCI DSS requirement that the entity meets with the customized approach, to include: () Documented evidence detailing each element specified in Appendix D: Customized Approach (including, at a minimum, a controls matrix and risk analysis). () Approval of documented evidence by senior management. () Performance of the targeted analysis of risk at least once every 12 months. [CUSTOMIZED APPROACH OBJECTIVE]: This requirement is part of the customized approach and must be met for those using the customized approach. [APPLICABILITY NOTES]: This requirement only applies to entities using a Customized Approach."
          },
          "12.3.3": {
            "title": "Cryptographic cipher suites and protocols in use are documented and reviewed at least once every 12 months, including at least the following: () An up-to-date inventory of all cryptographic cipher suites and protocols in use, including purpose and where used. () Active monitoring of industry trends regarding continued viability of all cryptographic cipher suites and protocols in use. () A documented strategy to respond to anticipated changes in cryptographic vulnerabilities. [CUSTOMIZED APPROACH OBJECTIVE]: The entity is able to respond quickly to any vulnerabilities in cryptographic protocols or algorithms, where those vulnerabilities affect protection of cardholder data. [APPLICABILITY NOTES]: The requirement applies to all cryptographic suites and protocols used to meet PCI DSS requirements. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "12.3.4": {
            "title": "Hardware and software technologies in use are reviewed at least once every 12 months, including at least the following: () Analysis that the technologies continue to receive security fixes from vendors promptly. () Analysis that the technologies continue to support (and do not preclude) the entity’s PCI DSS compliance. () Documentation of any industry announcements or trends related to a technology, such as when a vendor has announced “end of life” plans for a technology. () Documentation of a plan, approved by senior management, to remediate outdated technologies, including those for which vendors have announced “end of life” plans. [CUSTOMIZED APPROACH OBJECTIVE]: The entity’s hardware and software technologies are up to date and supported by the vendor. Plans to remove or replace all unsupported system components are reviewed periodically. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "12.4": {
        "title": "PCI DSS compliance is managed.",
        "defined_approaches": {
          "12.4.1": {
            "title": "Additional requirement for service providers only: Responsibility is established by executive management for the protection of cardholder data and a PCI DSS compliance program to include: () Overall accountability for maintaining PCI DSS compliance. () Defining a charter for a PCI DSS compliance program and communication to executive management. [CUSTOMIZED APPROACH OBJECTIVE]: Executives are responsible and accountable for security of cardholder data. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. Executive management may include C-level positions, board of directors, or equivalent. The specific titles will depend on the particular organizational structure. Responsibility for the PCI DSS compliance program may be assigned to individual roles and/or to business units within the organization."
          },
          "12.4.2": {
            "title": "Additional requirement for service providers only: Reviews are performed at least once every three months to confirm that personnel are performing their tasks in accordance with all security policies and operational procedures. Reviews are performed by personnel other than those responsible for performing the given task and include, but are not limited to, the following tasks: () Daily log reviews. () Configuration reviews for network security controls. () Applying configuration standards to new systems. () Responding to security alerts. () Change-management processes. [CUSTOMIZED APPROACH OBJECTIVE]: The operational effectiveness of critical PCI DSS controls is verified periodically by manual inspection of records. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider."
          },
          "12.4.2.1": {
            "title": "Additional requirement for service providers only: Reviews conducted in accordance with Requirement 12.4.2 are documented to include: () Results of the reviews. () Documented remediation actions taken for any tasks that were found to not be performed at Requirement 12.4.2. () Review and sign-off of results by personnel assigned responsibility for the PCI DSS compliance program. [CUSTOMIZED APPROACH OBJECTIVE]: Findings from operational effectiveness reviews are evaluated by management; appropriate remediation activities are implemented. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider."
          }
        }
      },
      "12.5": {
        "title": "PCI DSS scope is documented and validated.",
        "defined_approaches": {
          "12.5.1": {
            "title": "An inventory of system components that are in scope for PCI DSS, including a description of function/use, is maintained and kept current. [CUSTOMIZED APPROACH OBJECTIVE]: All system components in scope for PCI DSS are identified and known."
          },
          "12.5.2": {
            "title": "PCI DSS scope is documented and confirmed by the entity at least once every 12 months and upon significant change to the in-scope environment. At a minimum, the scoping validation includes: () Identifying all data flows for the various payment stages (for example, authorization, capture settlement, chargebacks, and refunds) and acceptance channels (for example, card-present, card-not-present, and e-commerce). () Updating all data-flow diagrams per Requirement 1.2.4. () Identifying all locations where account data is stored, processed, and transmitted, including but not limited to: 1) any locations outside of the currently defined CDE, 2) applications that process CHD, 3) transmissions between systems and networks, and 4) file backups. () Identifying all system components in the CDE, connected to the CDE, or that could impact security of the CDE. () Identifying all segmentation controls in use and the environment(s) from which the CDE is segmented, including justification for environments being out of scope. () Identifying all connections from third-party entities with access to the CDE. () Confirming that all identified data flows, account data, system components, segmentation controls, and connections from third parties with access to the CDE are included in scope. [CUSTOMIZED APPROACH OBJECTIVE]: PCI DSS scope is verified periodically, and after significant changes, by comprehensive analysis and appropriate technical measures. [APPLICABILITY NOTES]: This annual confirmation of PCI DSS scope is an activity expected to be performed by the entity under assessment, and is not the same, nor is it intended to be replaced by, the scoping confirmation performed by the entity’s assessor during the annual assessment."
          },
          "12.5.2.1": {
            "title": "Additional requirement for service providers only: PCI DSS scope is documented and confirmed by the entity at least once every six months and upon significant change to the in-scope environment. At a minimum, the scoping validation includes all the elements specified in Requirement 12.5.2. [CUSTOMIZED APPROACH OBJECTIVE]: The accuracy of PCI DSS scope is verified to be continuously accurate by comprehensive analysis and appropriate technical measures. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "12.5.3": {
            "title": "Additional requirement for service providers only: Significant changes to organizational structure result in a documented (internal) review of the impact to PCI DSS scope and applicability of controls, with results communicated to executive management. [CUSTOMIZED APPROACH OBJECTIVE]: PCI DSS scope is confirmed after significant organizational change. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "12.6": {
        "title": "Security awareness education is an ongoing activity.",
        "defined_approaches": {
          "12.6.1": {
            "title": "A formal security awareness program is implemented to make all personnel aware of the entity’s information security policy and procedures, and their role in protecting the cardholder data. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel are knowledgeable about the threat landscape, their responsibility for the operation of relevant security controls, and are able to access assistance and guidance when required."
          },
          "12.6.2": {
            "title": "The security awareness program is: () Reviewed at least once every 12 months, and () Updated as needed to address any new threats and vulnerabilities that may impact the security of the entity’s CDE, or the information provided to personnel about their role in protecting cardholder data. [CUSTOMIZED APPROACH OBJECTIVE]: The content of security awareness material is reviewed and updated periodically. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "12.6.3": {
            "title": "Personnel receive security awareness training as follows: () Upon hire and at least once every 12 months. () Multiple methods of communication are used. () Personnel acknowledge at least once every 12 months that they have read and understood the information security policy and procedures. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel remain knowledgeable about the threat landscape, their responsibility for the operation of relevant security controls, and are able to access assistance and guidance when required."
          },
          "12.6.3.1": {
            "title": "Security awareness training includes awareness of threats and vulnerabilities that could impact the security of the CDE, including but not limited to: () Phishing and related attacks. () Social engineering. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel are knowledgeable about their own human vulnerabilities and how threat actors will attempt to exploit such vulnerabilities. Personnel are able to access assistance and guidance when required. [APPLICABILITY NOTES]: See Requirement 5.4.1 for guidance on the difference between technical and automated controls to detect and protect users from phishing attacks, and this requirement for providing users security awareness training about phishing and social engineering. These are two separate and distinct requirements, and one is not met by implementing controls required by the other one. This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "12.6.3.2": {
            "title": "Security awareness training includes awareness about the acceptable use of end-user technologies in accordance with Requirement 12.2.1. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel are knowledgeable about their responsibility for the security and operation of enduser technologies and are able to access assistance and guidance when required. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      },
      "12.7": {
        "title": "Personnel are screened to reduce risks from insider threats.",
        "defined_approaches": {
          "12.7.1": {
            "title": "Potential personnel who will have access to the CDE are screened, within the constraints of local laws, prior to hire to minimize the risk of attacks from internal sources. [CUSTOMIZED APPROACH OBJECTIVE]: The risk related to allowing new members of staff access to the CDE is understood and managed. [APPLICABILITY NOTES]: For those potential personnel to be hired for positions such as store cashiers, who only have access to one card number at a time when facilitating a transaction, this requirement is a recommendation only."
          }
        }
      },
      "12.8": {
        "title": "Risk to information assets associated with third-party service provider (TPSP) relationships is managed.",
        "defined_approaches": {
          "12.8.1": {
            "title": "A list of all third-party service providers (TPSPs) with which account data is shared or that could affect the security of account data is maintained, including a description for each of the services provided. [CUSTOMIZED APPROACH OBJECTIVE]: Records are maintained of TPSPs and the services provided. [APPLICABILITY NOTES]: The use of a PCI DSS compliant TPSP does not make an entity PCI DSS compliant, nor does it remove the entity’s responsibility for its own PCI DSS compliance."
          },
          "12.8.2": {
            "title": "Written agreements with TPSPs are maintained as follows: () Written agreements are maintained with all TPSPs with which account data is shared or that could affect the security of the CDE. () Written agreements include acknowledgments from TPSPs that they are responsible for the security of account data the TPSPs possess or otherwise store, process, or transmit on behalf of the entity, or to the extent that they could impact the security of the entity’s CDE. [CUSTOMIZED APPROACH OBJECTIVE]: Records are maintained of each TPSP’s acknowledgment of its responsibility to protect account data. [APPLICABILITY NOTES]: The exact wording of an acknowledgment will depend on the agreement between the two parties, the details of the service being provided, and the responsibilities assigned to each party. The acknowledgment does not have to include the exact wording provided in this requirement. Evidence that a TPSP is meeting PCI DSS requirements (for example, a PCI DSS Attestation of Compliance (AOC) or a declaration on a company’s website) is not the same as a written agreement specified in this requirement."
          },
          "12.8.3": {
            "title": "An established process is implemented for engaging TPSPs, including proper due diligence prior to engagement. [CUSTOMIZED APPROACH OBJECTIVE]: The capability, intent, and resources of a prospective TPSP to adequately protect account data are assessed before the TPSP is engaged."
          },
          "12.8.4": {
            "title": "A program is implemented to monitor TPSPs’ PCI DSS compliance status at least once every 12 months. [CUSTOMIZED APPROACH OBJECTIVE]: The PCI DSS compliance status of TPSPs is verified periodically. [APPLICABILITY NOTES]: Where an entity has an agreement with a TPSP for meeting PCI DSS requirements on behalf of the entity (for example, via a firewall service), the entity must work with the TPSP to make sure the applicable PCI DSS requirements are met. If the TPSP does not meet those applicable PCI DSS requirements, then those requirements are also “not in place” for the entity."
          },
          "12.8.5": {
            "title": "Information is maintained about which PCI DSS requirements are managed by each TPSP, which are managed by the entity, and any that are shared between the TPSP and the entity. [CUSTOMIZED APPROACH OBJECTIVE]: Records detailing the PCI DSS requirements and related system components for which each TPSP is solely or jointly responsible, are maintained and reviewed periodically."
          }
        }
      },
      "12.9": {
        "title": "Third-party service providers (TPSPs) support their customers’ PCI DSS compliance.",
        "defined_approaches": {
          "12.9.1": {
            "title": "Additional requirement for service providers only: TPSPs acknowledge in writing to customers that they are responsible for the security of account data the TPSP possesses or otherwise stores, processes, or transmits on behalf of the customer, or to the extent that they could impact the security of the customer’s CDE. [CUSTOMIZED APPROACH OBJECTIVE]: TPSPs formally acknowledge their security responsibilities to their customers. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider. The exact wording of an acknowledgment will depend on the agreement between the two parties, the details of the service being provided, and the responsibilities assigned to each party. The acknowledgment does not have to include the exact wording provided in this requirement."
          },
          "12.9.2": {
            "title": "Additional requirement for service providers only: TPSPs support their customers’ requests for information to meet Requirements 12.8.4 and 12.8.5 by providing the following upon customer request: () PCI DSS compliance status information for any service the TPSP performs on behalf of customers (Requirement 12.8.4). () Information about which PCI DSS requirements are the responsibility of the TPSP and which are the responsibility of the customer, including any shared responsibilities (Requirement 12.8.5). [CUSTOMIZED APPROACH OBJECTIVE]: TPSPs provide information as needed to support their customers’ PCI DSS compliance efforts. [APPLICABILITY NOTES]: This requirement applies only when the entity being assessed is a service provider."
          }
        }
      },
      "12.10": {
        "title": "Suspected and confirmed security incidents that could impact the CDE are responded to immediately.",
        "defined_approaches": {
          "12.10.1": {
            "title": "An incident response plan exists and is ready to be activated in the event of a suspected or confirmed security incident. The plan includes, but is not limited to: () Roles, responsibilities, and communication and contact strategies in the event of a suspected or confirmed security incident, including notification of payment brands and acquirers, at a minimum. () Incident response procedures with specific containment and mitigation activities for different types of incidents. () Business recovery and continuity procedures. () Data backup processes. () Analysis of legal requirements for reporting compromises. () Coverage and responses of all critical system components. () Reference or inclusion of incident response procedures from the payment brands. [CUSTOMIZED APPROACH OBJECTIVE]: A comprehensive incident response plan that meets card brand expectations is maintained."
          },
          "12.10.2": {
            "title": "At least once every 12 months, the security incident response plan is: () Reviewed and the content is updated as needed. () Tested, including all elements listed in Requirement 12.10.1. [CUSTOMIZED APPROACH OBJECTIVE]: The incident response plan is kept current and tested periodically."
          },
          "12.10.3": {
            "title": "Specific personnel are designated to be available on a 24/7 basis to respond to suspected or confirmed security incidents. [CUSTOMIZED APPROACH OBJECTIVE]: Incidents are responded to immediately where appropriate."
          },
          "12.10.4": {
            "title": "Personnel responsible for responding to suspected and confirmed security incidents are appropriately and periodically trained on their incident response responsibilities. [CUSTOMIZED APPROACH OBJECTIVE]: Personnel are knowledgeable about their role and responsibilities in incident response and are able to access assistance and guidance when required."
          },
          "12.10.4.1": {
            "title": "The frequency of periodic training for incident response personnel is defined in the entity’s targeted risk analysis, which is performed according to all elements specified in Requirement 12.3.1. [CUSTOMIZED APPROACH OBJECTIVE]: Incident response personnel are trained at a frequency that addresses the entity’s risk. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          },
          "12.10.5": {
            "title": "The security incident response plan includes monitoring and responding to alerts from security monitoring systems, including but not limited to: () Intrusion-detection and intrusion-prevention systems. () Network security controls. () Change-detection mechanisms for critical files. () The change-and tamper-detection mechanism for payment pages. This bullet is a best practice until its effective date; refer to [APPLICABILITY NOTES]: below for details. () Detection of unauthorized wireless access points. [CUSTOMIZED APPROACH OBJECTIVE]: Alerts generated by monitoring and detection technologies are responded to in a structured, repeatable manner. [APPLICABILITY NOTES]: The bullet above (for monitoring and responding to alerts from a change- and tamper-detection mechanism for payment pages) is a best practice until 31 March 2025, after which it will be required as part of Requirement 12.10.5 and must be fully considered during a PCI DSS assessment."
          },
          "12.10.6": {
            "title": "The security incident response plan is modified and evolved according to lessons learned and to incorporate industry developments. [CUSTOMIZED APPROACH OBJECTIVE]: The effectiveness and accuracy of the incident response plan is reviewed and updated after each invocation."
          },
          "12.10.7": {
            "title": "Incident response procedures are in place, to be initiated upon the detection of stored PAN anywhere it is not expected, and include: () Determining what to do if PAN is discovered outside the CDE, including its retrieval, secure deletion, and/or migration into the currently defined CDE, as applicable. () Identifying whether sensitive authentication data is stored with PAN. () Determining where the account data came from and how it ended up where it was not expected. () Remediating data leaks or process gaps that resulted in the account data being where it was not expected. [CUSTOMIZED APPROACH OBJECTIVE]: Processes are in place to quickly respond, analyze, and address situations in the event that cleartext PAN is detected where it is not expected. [APPLICABILITY NOTES]: This requirement is a best practice until 31 March 2025, after which it will be required and must be fully considered during a PCI DSS assessment."
          }
        }
      }
    }
  },
  "A1": {
    "title": "Additional PCI DSS Requirements for Multi-Tenant Service Providers",
    "subreqs": {
      "A1.1": {
        "title": "Multi-tenant service providers protect and separate all customer environments and data.",
        "defined_approaches": {
          "A1.1.1": {
            "title": "Logical separation is implemented as follows: () The provider cannot access its customers’ environments without authorization. () Customers cannot access the provider’s environment without authorization."
          },
          "A1.1.2": {
            "title": "Controls are implemented such that each customer only has permission to access its own cardholder data and CDE."
          },
          "A1.1.3": {
            "title": "Controls are implemented such that each customer can only access resources allocated to them."
          },
          "A1.1.4": {
            "title": "The effectiveness of logical separation controls used to separate customer environments is confirmed at least once every six months via penetration testing."
          }
        }
      },
      "A1.2": {
        "title": "Multi-tenant service providers facilitate logging and incident response for all customers.",
        "defined_approaches": {
          "A1.2.1": {
            "title": "Audit log capability is enabled for each customer’s environment that is consistent with PCI DSS Requirement 10, including: () Logs are enabled for common third-party applications. () Logs are active by default. () Logs are available for review only by the owning customer. () Log locations are clearly communicated to the owning customer. () Log data and availability is consistent with PCI DSS Requirement 10."
          },
          "A1.2.2": {
            "title": "Processes or mechanisms are implemented to support and/or facilitate prompt forensic investigations in the event of a suspected or confirmed security incident for any customer."
          },
          "A1.2.3": {
            "title": "Processes or mechanisms are implemented for reporting and addressing suspected or confirmed security incidents and vulnerabilities, including: () Customers can securely report security incidents and vulnerabilities to the provider. () The provider addresses and remediates suspected or confirmed security incidents and vulnerabilities according to Requirement 6.3.1."
          }
        }
      }
    }
  },
  "A2": {
    "title": "Additional PCI DSS Requirements for Entities Using SSL/Early TLS for Card-Present POS POI Terminal Connections",
    "subreqs": {
      "A2.1": {
        "title": "POI terminals using SSL and/or early TLS are confirmed as not susceptible to known SSL/TLS exploits.",
        "defined_approaches": {
          "A2.1.1": {
            "title": "AWhere POS POI terminals at the merchant or payment acceptance location use SSL and/or early TLS, the entity confirms the devices are not susceptible to any known exploits for those protocols."
          },
          "A2.1.2": {
            "title": "Additional requirement for service providers only: All service providers with existing connection points to POS POI terminals that use SSL and/or early TLS as defined in A2.1 have a formal Risk Mitigation and Migration Plan in place that includes: () Description of usage, including what data is being transmitted, types and number of systems that use and/or support SSL/early TLS, and type of environment. () Risk-assessment results and risk-reduction controls in place. () Description of processes to monitor for new vulnerabilities associated with SSL/early TLS. () Description of change control processes that are implemented to ensure SSL/early TLS is not implemented into new environments. () Overview of migration project plan to replace SSL/early TLS at a future date."
          },
          "A2.1.3": {
            "title": "Additional requirement for service providers only: All service providers provide a secure service offering."
          }
        }
      }
    }
  },
  "A3": {
    "title": "Designated Entities Supplemental Validation (DESV)",
    "subreqs": {
      "A3.1": {
        "title": "A PCI DSS compliance program is implemented.",
        "defined_approaches": {
          "A3.1.1": {
            "title": "Responsibility is established by executive management for the protection of account data and a PCI DSS compliance program that includes: () Overall accountability for maintaining PCI DSS compliance. () Defining a charter for a PCI DSS compliance program. () Providing updates to executive management and board of directors on PCI DSS compliance initiatives and issues, including remediation activities, at least once every 12 months. PCI DSS Reference: Requirement 12"
          },
          "A3.1.2": {
            "title": "A formal PCI DSS compliance program is in place that includes: () Definition of activities for maintaining and monitoring overall PCI DSS compliance, including business-as-usual activities. () Annual PCI DSS assessment processes. () Processes for the continuous validation of PCI DSS requirements (for example, daily, weekly, every three months, as applicable per the requirement). () A process for performing business-impact analysis to determine potential PCI DSS impacts for strategic business decisions. PCI DSS Reference: Requirements 1-12"
          },
          "A3.1.3": {
            "title": "PCI DSS compliance roles and responsibilities are specifically defined and formally assigned to one or more personnel, including: () Managing PCI DSS business-as-usual activities. () Managing annual PCI DSS assessments. () Managing continuous validation of PCI DSS requirements (for example, daily, weekly, every three months, as applicable per the requirement). () Managing business-impact analysis to determine potential PCI DSS impacts for strategic business decisions. PCI DSS Reference: Requirement 12"
          },
          "A3.1.4": {
            "title": "Up-to-date PCI DSS and/or information security training is provided at least once every 12 months to personnel with PCI DSS compliance responsibilities (as identified in A3.1.3). PCI DSS Reference: Requirement 12"
          }
        }
      },
      "A3.2": {
        "title": "PCI DSS scope is documented and validated.",
        "defined_approaches": {
          "A3.2.1": {
            "title": "PCI DSS scope is documented and confirmed for accuracy at least once every three months and upon significant changes to the inscope environment. At a minimum, the scoping validation includes: () Identifying all data flows for the various payment stages (for example, authorization, capture, settlement, chargebacks, and refunds) and acceptance channels (for example, card-present, card-not-present, and e-commerce). () Updating all data-flow diagrams per Requirement 1.2.4. () Identifying all locations where account data is stored, processed, and transmitted, including but not limited to 1) any locations outside of the currently defined CDE, 2) applications that process CHD, 3) transmissions between systems and networks, and 4) file backups. () For any account data found outside of the currently defined CDE, either 1) securely delete it, 2) migrate it into the currently defined CDE, or 3) expand the currently defined CDE to include it. () Identifying all system components in the CDE, connected to the CDE, or that could impact security of the CDE. () Identifying all segmentation controls in use and the environment(s) from which the CDE is segmented, including justification for environments being out of scope. () Identifying all connections to third-party entities with access to the CDE. () Confirming that all identified data flows, account data, system components, segmentation controls, and connections from third parties with access to the CDE are included in scope. PCI DSS Reference: Scope of PCI DSS Requirements, Requirement 12."
          },
          "A3.2.2": {
            "title": "PCI DSS scope impact for all changes to systems or networks is determined, including additions of new systems and new network connections. Processes include: () Performing a formal PCI DSS impact assessment. () Identifying applicable PCI DSS requirements to the system or network. () Updating PCI DSS scope as appropriate. () Documented sign-off of the results of the impact assessment by responsible personnel (as defined in A3.1.3). PCI DSS Reference: Scope of PCI DSS Requirements; Requirements 1-12"
          },
          "A3.2.2.1": {
            "title": "AUpon completion of a change, all relevant PCI DSS requirements are confirmed to be implemented on all new or changed systems and networks, and documentation is updated as applicable. PCI DSS Reference: Scope of PCI DSS Requirements; Requirement 1-12"
          },
          "A3.2.3": {
            "title": "Changes to organizational structure result in a formal (internal) review of the impact to PCI DSS scope and applicability of controls. PCI DSS Reference: Requirement 12"
          },
          "A3.2.4": {
            "title": "If segmentation is used, PCI DSS scope is confirmed as follows: () Per the entity’s methodology defined at Requirement 11.4.1. () Penetration testing is performed on segmentation controls at least once every six months and after any changes to segmentation controls/methods. () The penetration testing covers all segmentation controls/methods in use. () The penetration testing verifies that segmentation controls/methods are operational and effective, and isolate the CDE from all outof-scope systems. PCI DSS Reference: Requirement 11"
          },
          "A3.2.5": {
            "title": "A data-discovery methodology is implemented that: () Confirms PCI DSS scope. () Locates all sources and locations of cleartext PAN at least once every three months and upon significant changes to the CDE or processes. () Addresses the potential for cleartext PAN to reside on systems and networks outside the currently defined CDE. PCI DSS Reference: Scope of PCI DSS Requirements"
          },
          "A3.2.5.1": {
            "title": "Data discovery methods are confirmed as follows: () Effectiveness of methods is tested. () Methods are able to discover cleartext PAN on all types of system components and file formats in use. () The effectiveness of data-discovery methods is confirmed at least once every 12 months. PCI DSS Reference: Scope of PCI DSS Requirements"
          },
          "A3.2.5.2": {
            "title": "Response procedures are implemented to be initiated upon the detection of cleartext PAN outside the CDE to include: () Determining what to do if cleartext PAN is discovered outside the CDE, including its retrieval, secure deletion, and/or migration into the currently defined CDE, as applicable. () Determining how the data ended up outside the CDE. () Remediating data leaks or process gaps that resulted in the data being outside the CDE. () Identifying the source of the data. () Identifying whether any track data is stored with the PANs."
          },
          "A3.2.6": {
            "title": "Mechanisms are implemented for detecting and preventing cleartext PAN from leaving the CDE via an unauthorized channel, method, or process, including mechanisms that are: () Actively running. () Configured to detect and prevent cleartext PAN leaving the CDE via an unauthorized channel, method, or process. () Generating audit logs and alerts upon detection of cleartext PAN leaving the CDE via an unauthorized channel, method, or process. PCI DSS Reference: Scope of PCI DSS Requirements, Requirement 12"
          },
          "A3.2.6.1": {
            "title": "Response procedures are implemented to be initiated upon the detection of attempts to remove cleartext PAN from the CDE via an unauthorized channel, method, or process. Response procedures include: () Procedures for the prompt investigation of alerts by responsible personnel. () Procedures for remediating data leaks or process gaps, as necessary, to prevent any data loss. PCI DSS Reference: Requirement 12"
          }
        }
      },
      "A3.3": {
        "title": "PCI DSS is incorporated into business-as-usual (BAU) activities.",
        "defined_approaches": {
          "A3.3.1": {
            "title": "Failures of critical security control systems are detected, alerted, and addressed promptly, including but not limited to failure of: () Network security controls () IDS/IPS () FIM () Anti-malware solutions () Physical access controls () Logical access controls () Audit logging mechanisms () Segmentation controls (if used) () Automated audit log review mechanisms. This bullet is a best practice until its effective date; refer to"
          },
          "A3.3.1.2": {
            "title": "Failures of any critical security control systems are responded to promptly. Processes for responding to failures in security control systems include: () Restoring security functions. () Identifying and documenting the duration (date and time from start to end) of the security failure. () Identifying and documenting the cause(s) of failure, including root cause, and documenting remediation required to address the root cause. () Identifying and addressing any security issues that arose during the failure. () Determining whether further actions are required as a result of the security failure. () Implementing controls to prevent the cause of failure from reoccurring. () Resuming monitoring of security controls. PCI DSS Reference: Requirements 1-12"
          },
          "A3.3.2": {
            "title": "Hardware and software technologies are reviewed at least once every 12 months to confirm whether they continue to meet the organization’s PCI DSS requirements. PCI DSS Reference: Requirements 2, 6, 12."
          },
          "A3.3.3": {
            "title": "Reviews are performed at least once every three months to verify BAU activities are being followed. Reviews are performed by personnel assigned to the PCI DSS compliance program (as identified in A3.1.3), and include: () Confirmation that all BAU activities, including A3.2.2, A3.2.6, and A3.3.1, are being performed. () Confirmation that personnel are following security policies and operational procedures (for example, daily log reviews, ruleset reviews for network security controls, configuration standards for new systems). () Documenting how the reviews were completed, including how all BAU activities were verified as being in place. () Collection of documented evidence as required for the annual PCI DSS assessment. () Review and sign-off of results by personnel assigned responsibility for the PCI DSS compliance program, as identified in A3.1.3. () Retention of records and documentation for at least 12 months, covering all BAU activities. PCI DSS Reference: Requirements 1-12"
          }
        }
      },
      "A3.4": {
        "title": "Logical access to the cardholder data environment is controlled and managed.",
        "defined_approaches": {
          "A3.4.1": {
            "title": "User accounts and access privileges to inscope system components are reviewed at least once every six months to ensure user accounts and access privileges remain appropriate based on job function, and that all access is authorized. PCI DSS Reference: Requirement 7"
          }
        }
      },
      "A3.5": {
        "title": "Suspicious events are identified and responded to.",
        "defined_approaches": {
          "A3.5.1": {
            "title": "A methodology is implemented for the prompt identification of attack patterns and undesirable behavior across systems that includes: () Identification of anomalies or suspicious activity as it occurs. () Issuance of prompt alerts upon detection of suspicious activity or anomaly to responsible personnel. () Response to alerts in accordance with documented response procedures. PCI DSS Reference: Requirements 10, 12"
          }
        }
      }
    }
  }
}
